{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 46768], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs", "optional": false}, "registered_name": null, "name": "inputs", "inbound_nodes": []}, {"module": "model.layers_custom", "class_name": "Diagonal", "config": {"name": "h0", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 23384, "activation": "tanh", "use_bias": true}, "registered_name": "Diagonal", "build_config": {"input_shape": [null, 46768]}, "name": "h0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 46768], "dtype": "float32", "keras_history": ["inputs", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_0", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}, "registered_name": null, "name": "dropout_0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 23384], "dtype": "float32", "keras_history": ["h0", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "model.layers_custom", "class_name": "SparseTF", "config": {"name": "h1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1268, "activation": "tanh", "use_bias": true, "nonzero_ind": {"class_name": "__numpy__", "config": {"value": [[0, 28], [0, 757], [0, 859], [2, 28], [2, 75], [2, 76], [2, 192], [2, 859], [2, 930], [2, 1266], [6, 147], [6, 519], [6, 1195], [7, 586], [7, 995], [8, 31], [8, 32], [8, 86], [8, 108], [8, 109], [8, 110], [8, 116], [8, 121], [8, 122], [8, 137], [8, 163], [8, 164], [8, 165], [8, 166], [8, 167], [8, 168], [8, 176], [8, 194], [8, 206], [8, 237], [8, 373], [8, 374], [8, 382], [8, 391], [8, 397], [8, 398], [8, 401], [8, 487], [8, 566], [8, 568], [8, 570], [8, 635], [8, 636], [8, 745], [8, 787], [8, 789], [8, 813], [8, 817], [8, 821], [8, 826], [8, 827], [8, 828], [8, 939], [8, 954], [8, 994], [8, 1014], [8, 1015], [8, 1017], [8, 1081], [8, 1094], [8, 1095], [11, 308], [11, 311], [15, 819], [18, 881], [18, 882], [20, 169], [20, 170], [20, 198], [20, 245], [20, 472], [20, 520], [20, 859], [21, 301], [21, 819], [25, 430], [25, 431], [25, 833], [28, 256], [28, 257], [28, 265], [29, 819], [30, 242], [30, 243], [30, 299], [30, 843], [32, 17], [32, 19], [32, 20], [32, 900], [33, 192], [33, 264], [33, 634], [33, 636], [33, 930], [33, 945], [33, 981], [33, 982], [34, 62], [34, 446], [36, 62], [36, 446], [36, 634], [36, 636], [37, 757], [39, 62], [39, 446], [40, 62], [40, 446], [40, 634], [40, 636], [40, 696], [40, 706], [41, 337], [41, 348], [41, 446], [42, 62], [42, 446], [43, 62], [43, 446], [43, 1019], [43, 1021], [44, 62], [44, 446], [45, 446], [46, 62], [46, 446], [47, 446], [47, 1117], [48, 446], [49, 112], [49, 238], [49, 240], [49, 244], [49, 634], [49, 636], [49, 927], [50, 264], [50, 446], [50, 634], [50, 636], [51, 446], [52, 446], [52, 634], [52, 636], [53, 446], [54, 446], [55, 446], [56, 146], [56, 226], [56, 227], [56, 253], [56, 256], [56, 257], [56, 321], [56, 322], [56, 446], [56, 519], [56, 936], [56, 1098], [56, 1106], [56, 1117], [56, 1120], [56, 1123], [56, 1129], [57, 446], [58, 446], [61, 226], [61, 227], [61, 446], [61, 634], [61, 636], [61, 1117], [61, 1119], [61, 1120], [62, 112], [62, 244], [62, 446], [62, 927], [62, 1106], [62, 1117], [62, 1119], [62, 1120], [62, 1123], [62, 1129], [63, 28], [63, 446], [63, 859], [63, 1117], [63, 1118], [63, 1120], [64, 123], [64, 323], [64, 446], [64, 821], [64, 1117], [64, 1118], [64, 1120], [65, 446], [65, 634], [65, 636], [67, 20], [67, 56], [67, 57], [67, 129], [67, 512], [67, 634], [67, 636], [68, 20], [68, 56], [68, 57], [68, 446], [68, 478], [68, 617], [68, 621], [68, 634], [68, 636], [69, 62], [69, 446], [69, 465], [69, 634], [69, 636], [69, 936], [69, 1009], [69, 1012], [70, 62], [70, 446], [70, 1009], [70, 1012], [71, 62], [71, 446], [71, 939], [71, 954], [71, 956], [71, 1009], [71, 1012], [72, 253], [72, 256], [72, 257], [72, 395], [72, 634], [72, 636], [72, 696], [73, 32], [73, 833], [73, 989], [73, 994], [73, 1256], [74, 446], [75, 1106], [75, 1123], [75, 1129], [77, 62], [77, 192], [77, 446], [77, 931], [77, 945], [77, 981], [77, 982], [78, 146], [78, 226], [78, 227], [78, 519], [78, 997], [78, 1106], [78, 1117], [78, 1120], [78, 1123], [78, 1129], [79, 62], [79, 446], [80, 62], [80, 446], [80, 634], [80, 636], [80, 945], [80, 981], [80, 982], [81, 62], [81, 446], [81, 634], [81, 636], [81, 945], [81, 981], [81, 982], [83, 94], [83, 96], [83, 308], [85, 26], [85, 491], [85, 859], [89, 94], [89, 95], [89, 308], [93, 699], [93, 705], [93, 1047], [94, 699], [94, 705], [94, 1047], [95, 699], [95, 705], [95, 1047], [97, 84], [97, 85], [97, 88], [98, 80], [98, 85], [98, 88], [99, 128], [99, 938], [100, 26], [100, 491], [100, 859], [102, 245], [102, 247], [102, 290], [102, 292], [102, 692], [102, 954], [102, 958], [102, 959], [102, 968], [102, 1050], [103, 245], [103, 247], [103, 290], [103, 292], [103, 692], [103, 954], [103, 958], [103, 959], [103, 968], [103, 1050], [106, 247], [106, 290], [106, 292], [106, 314], [106, 424], [106, 565], [106, 596], [106, 692], [106, 708], [106, 718], [106, 720], [106, 722], [106, 800], [106, 845], [106, 898], [106, 899], [106, 906], [106, 909], [106, 910], [106, 1050], [106, 1158], [106, 1181], [106, 1205], [106, 1211], [106, 1224], [107, 424], [107, 954], [107, 958], [107, 968], [107, 1011], [107, 1096], [108, 417], [109, 417], [110, 417], [111, 821], [111, 985], [112, 242], [112, 243], [112, 299], [112, 492], [112, 843], [112, 939], [112, 954], [112, 955], [112, 956], [112, 957], [112, 958], [112, 959], [112, 968], [118, 465], [118, 757], [118, 936], [118, 984], [118, 1012], [119, 864], [119, 936], [120, 129], [120, 140], [120, 256], [120, 257], [120, 347], [120, 395], [120, 696], [120, 853], [120, 927], [120, 936], [121, 129], [121, 140], [121, 256], [121, 257], [121, 347], [121, 927], [121, 936], [122, 864], [122, 936], [123, 864], [123, 936], [124, 818], [124, 819], [124, 1191], [125, 67], [125, 734], [125, 758], [126, 864], [126, 936], [127, 264], [127, 864], [127, 936], [128, 864], [128, 936], [129, 818], [129, 819], [129, 1191], [130, 438], [130, 440], [130, 864], [130, 936], [131, 75], [131, 76], [131, 123], [131, 130], [131, 277], [131, 278], [131, 380], [131, 411], [131, 428], [131, 696], [131, 821], [135, 67], [135, 696], [135, 818], [135, 819], [135, 822], [135, 1191], [135, 1204], [136, 236], [136, 927], [137, 268], [137, 528], [138, 465], [138, 936], [139, 465], [139, 936], [139, 939], [139, 954], [139, 956], [139, 1009], [139, 1012], [140, 864], [140, 936], [141, 864], [141, 936], [144, 7], [144, 8], [144, 36], [144, 74], [144, 90], [144, 104], [144, 178], [144, 179], [144, 187], [144, 188], [144, 189], [144, 190], [144, 207], [144, 356], [144, 359], [144, 841], [144, 842], [144, 845], [144, 1064], [145, 276], [145, 372], [146, 276], [146, 372], [146, 1071], [146, 1072], [146, 1081], [146, 1083], [146, 1111], [146, 1149], [146, 1150], [147, 519], [148, 519], [149, 519], [150, 19], [150, 20], [150, 84], [150, 85], [150, 88], [150, 372], [150, 511], [151, 0], [151, 11], [151, 603], [151, 823], [151, 827], [151, 854], [152, 415], [152, 422], [152, 432], [152, 580], [153, 415], [153, 422], [153, 432], [153, 503], [153, 580], [154, 415], [154, 422], [154, 432], [154, 580], [155, 129], [155, 757], [155, 853], [155, 936], [156, 819], [158, 257], [158, 937], [158, 997], [159, 53], [159, 67], [159, 822], [159, 1012], [159, 1191], [159, 1204], [160, 864], [160, 936], [161, 864], [161, 936], [162, 864], [162, 936], [163, 864], [163, 936], [164, 864], [164, 936], [164, 984], [164, 1012], [164, 1191], [164, 1194], [164, 1225], [164, 1228], [165, 465], [165, 936], [165, 984], [165, 1012], [167, 864], [167, 936], [168, 238], [168, 240], [168, 244], [168, 465], [168, 927], [168, 936], [168, 984], [168, 1012], [169, 864], [169, 936], [170, 264], [170, 465], [170, 936], [170, 984], [170, 1012], [171, 238], [171, 240], [171, 244], [171, 465], [171, 927], [171, 936], [171, 984], [171, 1012], [172, 465], [172, 936], [172, 984], [172, 1012], [173, 465], [173, 936], [176, 256], [176, 257], [177, 83], [177, 85], [177, 88], [181, 35], [181, 74], [185, 853], [185, 856], [185, 936], [186, 853], [186, 856], [186, 936], [187, 864], [187, 936], [188, 853], [188, 856], [188, 936], [189, 264], [189, 314], [189, 853], [189, 856], [189, 936], [189, 1158], [189, 1224], [190, 129], [190, 512], [190, 853], [190, 856], [190, 936], [191, 129], [191, 512], [191, 853], [191, 856], [191, 936], [192, 853], [192, 856], [192, 936], [193, 853], [193, 856], [193, 936], [194, 94], [194, 308], [195, 94], [195, 308], [195, 1117], [195, 1119], [196, 94], [196, 308], [196, 1117], [196, 1119], [197, 864], [197, 936], [198, 94], [198, 308], [198, 1117], [198, 1119], [199, 94], [199, 308], [199, 1117], [199, 1119], [200, 308], [200, 311], [201, 107], [201, 217], [201, 308], [201, 311], [201, 324], [202, 314], [202, 1158], [202, 1224], [203, 76], [203, 91], [203, 379], [203, 463], [203, 478], [203, 505], [203, 510], [203, 1131], [203, 1135], [203, 1223], [203, 1264], [204, 76], [204, 91], [204, 103], [204, 379], [204, 478], [204, 505], [204, 510], [204, 540], [204, 972], [204, 973], [204, 1131], [204, 1135], [204, 1223], [204, 1264], [205, 32], [205, 71], [205, 76], [205, 91], [205, 105], [205, 245], [205, 247], [205, 290], [205, 292], [205, 314], [205, 365], [205, 379], [205, 387], [205, 393], [205, 420], [205, 457], [205, 458], [205, 461], [205, 474], [205, 477], [205, 505], [205, 510], [205, 530], [205, 538], [205, 546], [205, 577], [205, 594], [205, 595], [205, 649], [205, 691], [205, 692], [205, 693], [205, 699], [205, 700], [205, 705], [205, 712], [205, 713], [205, 727], [205, 730], [205, 731], [205, 759], [205, 760], [205, 761], [205, 845], [205, 882], [205, 954], [205, 987], [205, 994], [205, 1050], [205, 1051], [205, 1055], [205, 1056], [205, 1110], [205, 1131], [205, 1135], [205, 1169], [205, 1181], [205, 1198], [205, 1203], [205, 1209], [205, 1223], [205, 1240], [205, 1241], [205, 1243], [205, 1244], [205, 1245], [205, 1246], [205, 1247], [205, 1257], [205, 1264], [208, 76], [208, 91], [208, 379], [208, 463], [208, 478], [208, 505], [208, 510], [208, 939], [208, 954], [208, 955], [208, 1131], [208, 1135], [208, 1223], [208, 1264], [209, 32], [209, 71], [209, 76], [209, 91], [209, 105], [209, 245], [209, 247], [209, 290], [209, 292], [209, 365], [209, 379], [209, 420], [209, 474], [209, 477], [209, 505], [209, 510], [209, 530], [209, 538], [209, 546], [209, 649], [209, 691], [209, 692], [209, 693], [209, 699], [209, 700], [209, 705], [209, 759], [209, 760], [209, 761], [209, 882], [209, 954], [209, 965], [209, 994], [209, 1050], [209, 1051], [209, 1055], [209, 1056], [209, 1097], [209, 1131], [209, 1135], [209, 1223], [209, 1257], [209, 1264], [210, 76], [210, 91], [210, 379], [210, 478], [210, 505], [210, 510], [210, 540], [210, 1131], [210, 1135], [210, 1223], [210, 1264], [212, 314], [212, 387], [212, 388], [212, 393], [212, 577], [212, 712], [212, 713], [212, 727], [212, 730], [212, 731], [212, 845], [212, 899], [212, 907], [212, 1110], [212, 1169], [212, 1198], [212, 1203], [212, 1209], [212, 1240], [212, 1241], [212, 1243], [212, 1244], [212, 1245], [212, 1246], [212, 1247], [213, 388], [213, 393], [213, 577], [213, 899], [213, 907], [213, 1240], [213, 1241], [213, 1247], [218, 28], [218, 76], [218, 91], [218, 378], [218, 379], [218, 418], [218, 546], [218, 859], [218, 954], [218, 960], [218, 965], [218, 987], [218, 1097], [219, 18], [219, 19], [219, 20], [219, 28], [219, 91], [219, 418], [219, 463], [219, 478], [219, 531], [219, 532], [219, 535], [219, 536], [219, 537], [219, 699], [219, 705], [219, 859], [219, 1016], [219, 1025], [219, 1029], [220, 91], [220, 418], [220, 463], [220, 478], [221, 28], [221, 91], [221, 418], [221, 859], [222, 267], [222, 320], [222, 399], [222, 544], [222, 757], [222, 777], [222, 780], [222, 783], [222, 880], [222, 1008], [223, 217], [223, 267], [223, 320], [223, 360], [223, 399], [223, 433], [223, 434], [223, 435], [223, 544], [223, 564], [223, 633], [223, 637], [223, 777], [223, 780], [223, 783], [223, 788], [223, 789], [223, 880], [223, 1008], [224, 320], [224, 757], [225, 247], [225, 290], [225, 292], [225, 365], [225, 474], [225, 692], [225, 757], [225, 882], [225, 1050], [226, 247], [226, 290], [226, 292], [226, 365], [226, 474], [226, 692], [226, 882], [226, 1050], [229, 712], [229, 713], [229, 727], [229, 730], [229, 731], [229, 845], [231, 712], [231, 713], [231, 727], [231, 730], [231, 731], [231, 845], [236, 34], [236, 92], [236, 946], [237, 34], [237, 92], [237, 946], [238, 34], [238, 92], [238, 269], [238, 946], [238, 1192], [239, 34], [239, 92], [239, 269], [239, 946], [240, 269], [240, 946], [241, 308], [241, 614], [241, 622], [241, 696], [241, 1117], [241, 1120], [242, 308], [242, 614], [245, 106], [245, 696], [245, 925], [245, 1117], [249, 70], [249, 75], [249, 76], [249, 103], [249, 198], [249, 259], [249, 260], [249, 316], [249, 361], [249, 365], [249, 366], [249, 371], [249, 442], [249, 477], [249, 691], [249, 757], [249, 926], [249, 953], [249, 970], [249, 972], [249, 1148], [251, 76], [251, 198], [252, 75], [252, 76], [253, 45], [253, 50], [253, 70], [253, 75], [253, 76], [253, 103], [253, 198], [253, 243], [253, 259], [253, 316], [253, 361], [253, 366], [253, 606], [253, 607], [253, 691], [253, 843], [253, 858], [253, 1050], [253, 1057], [253, 1172], [255, 76], [255, 91], [255, 505], [255, 510], [255, 1130], [255, 1131], [257, 35], [257, 74], [258, 35], [258, 74], [260, 35], [260, 74], [266, 35], [266, 74], [268, 91], [268, 505], [268, 510], [268, 1130], [268, 1131], [273, 75], [273, 76], [273, 757], [274, 70], [274, 75], [274, 76], [276, 75], [276, 76], [276, 428], [276, 464], [276, 583], [276, 586], [276, 696], [277, 428], [277, 464], [277, 583], [277, 586], [277, 696], [278, 428], [278, 464], [278, 583], [278, 586], [278, 696], [279, 428], [279, 464], [279, 583], [279, 586], [279, 696], [279, 857], [279, 1066], [279, 1143], [279, 1144], [280, 76], [280, 77], [280, 138], [280, 428], [280, 464], [280, 583], [280, 586], [280, 696], [281, 428], [281, 464], [281, 583], [281, 586], [281, 696], [282, 75], [282, 76], [282, 428], [282, 464], [282, 583], [282, 586], [282, 696], [283, 428], [283, 464], [283, 583], [283, 586], [283, 696], [284, 75], [284, 76], [284, 428], [284, 464], [284, 583], [284, 586], [284, 696], [285, 428], [285, 464], [285, 583], [285, 586], [285, 696], [286, 76], [286, 77], [286, 138], [286, 428], [286, 464], [286, 583], [286, 586], [286, 696], [287, 428], [287, 464], [287, 583], [287, 586], [287, 696], [288, 76], [288, 77], [288, 138], [288, 428], [288, 464], [288, 583], [288, 586], [288, 696], [289, 75], [289, 76], [289, 428], [289, 464], [289, 583], [289, 586], [289, 696], [290, 75], [290, 76], [290, 428], [290, 464], [290, 583], [290, 586], [290, 696], [291, 428], [291, 464], [291, 583], [291, 586], [291, 696], [292, 428], [292, 464], [292, 583], [292, 586], [292, 696], [293, 75], [293, 76], [293, 428], [293, 464], [293, 583], [293, 586], [293, 696], [294, 75], [294, 76], [294, 428], [294, 464], [294, 583], [294, 586], [294, 696], [295, 428], [295, 464], [295, 583], [295, 586], [295, 696], [296, 428], [296, 464], [296, 583], [296, 586], [296, 696], [297, 428], [297, 464], [297, 583], [297, 586], [297, 696], [298, 428], [298, 464], [298, 583], [298, 586], [298, 696], [299, 428], [299, 464], [299, 583], [299, 586], [299, 696], [300, 45], [300, 50], [302, 32], [302, 989], [302, 994], [302, 1184], [305, 741], [305, 828], [306, 741], [306, 828], [307, 741], [307, 828], [314, 13], [314, 14], [314, 15], [314, 16], [314, 18], [314, 19], [314, 20], [314, 89], [314, 127], [314, 129], [314, 134], [314, 501], [314, 503], [314, 504], [314, 525], [314, 531], [314, 536], [314, 541], [314, 607], [314, 631], [314, 944], [314, 1032], [314, 1050], [314, 1053], [314, 1057], [314, 1059], [314, 1152], [314, 1153], [314, 1205], [314, 1206], [315, 607], [315, 631], [317, 13], [317, 14], [317, 15], [317, 16], [317, 18], [317, 19], [317, 20], [317, 89], [317, 127], [317, 129], [317, 134], [317, 501], [317, 503], [317, 504], [317, 525], [317, 541], [317, 607], [317, 631], [317, 944], [317, 1032], [317, 1050], [317, 1053], [317, 1057], [317, 1059], [317, 1152], [317, 1153], [317, 1205], [317, 1206], [318, 13], [318, 14], [318, 15], [318, 16], [318, 18], [318, 19], [318, 20], [318, 89], [318, 127], [318, 129], [318, 134], [318, 444], [318, 501], [318, 503], [318, 504], [318, 525], [318, 541], [318, 607], [318, 631], [318, 944], [318, 1032], [318, 1050], [318, 1053], [318, 1057], [318, 1059], [318, 1152], [318, 1153], [318, 1205], [318, 1206], [319, 13], [319, 14], [319, 15], [319, 16], [319, 18], [319, 19], [319, 20], [319, 89], [319, 127], [319, 129], [319, 134], [319, 501], [319, 503], [319, 504], [319, 525], [319, 541], [319, 607], [319, 631], [319, 944], [319, 1032], [319, 1050], [319, 1053], [319, 1057], [319, 1059], [319, 1152], [319, 1153], [319, 1205], [319, 1206], [320, 13], [320, 14], [320, 15], [320, 16], [320, 18], [320, 19], [320, 20], [320, 89], [320, 127], [320, 129], [320, 134], [320, 443], [320, 483], [320, 501], [320, 503], [320, 504], [320, 512], [320, 525], [320, 541], [320, 607], [320, 631], [320, 944], [320, 1032], [320, 1050], [320, 1053], [320, 1057], [320, 1059], [320, 1152], [320, 1153], [320, 1205], [320, 1206], [321, 13], [321, 14], [321, 15], [321, 16], [321, 18], [321, 19], [321, 20], [321, 89], [321, 127], [321, 129], [321, 134], [321, 443], [321, 483], [321, 501], [321, 503], [321, 504], [321, 512], [321, 525], [321, 541], [321, 607], [321, 631], [321, 944], [321, 1032], [321, 1050], [321, 1053], [321, 1057], [321, 1059], [321, 1152], [321, 1153], [321, 1205], [321, 1206], [322, 13], [322, 14], [322, 15], [322, 16], [322, 18], [322, 19], [322, 20], [322, 89], [322, 127], [322, 129], [322, 134], [322, 501], [322, 503], [322, 504], [322, 525], [322, 541], [322, 607], [322, 631], [322, 944], [322, 1032], [322, 1050], [322, 1053], [322, 1057], [322, 1059], [322, 1152], [322, 1153], [322, 1205], [322, 1206], [323, 13], [323, 14], [323, 15], [323, 16], [323, 18], [323, 19], [323, 20], [323, 89], [323, 127], [323, 129], [323, 134], [323, 443], [323, 501], [323, 503], [323, 504], [323, 512], [323, 525], [323, 531], [323, 536], [323, 541], [323, 607], [323, 631], [323, 944], [323, 1032], [323, 1050], [323, 1053], [323, 1057], [323, 1059], [323, 1152], [323, 1153], [323, 1205], [323, 1206], [324, 13], [324, 14], [324, 15], [324, 16], [324, 18], [324, 19], [324, 20], [324, 89], [324, 127], [324, 129], [324, 134], [324, 501], [324, 503], [324, 504], [324, 525], [324, 541], [324, 607], [324, 631], [324, 944], [324, 1032], [324, 1050], [324, 1053], [324, 1057], [324, 1059], [324, 1152], [324, 1153], [324, 1205], [324, 1206], [325, 150], [325, 222], [325, 416], [325, 501], [325, 508], [325, 580], [326, 150], [326, 222], [326, 416], [326, 501], [326, 508], [326, 580], [327, 0], [327, 11], [327, 438], [327, 440], [327, 593], [327, 603], [327, 854], [328, 593], [329, 593], [329, 954], [329, 960], [329, 987], [331, 308], [331, 311], [331, 609], [331, 611], [331, 945], [331, 1117], [332, 308], [332, 311], [333, 308], [333, 311], [333, 609], [333, 611], [333, 945], [334, 308], [334, 311], [334, 609], [334, 611], [334, 945], [335, 308], [335, 311], [336, 308], [336, 311], [337, 308], [337, 309], [337, 310], [337, 311], [338, 67], [339, 115], [339, 819], [341, 129], [341, 314], [341, 441], [341, 1158], [341, 1200], [341, 1224], [342, 129], [343, 129], [344, 441], [344, 1200], [345, 106], [345, 925], [345, 1117], [346, 416], [346, 501], [346, 580], [346, 1205], [346, 1206], [347, 416], [347, 501], [347, 580], [349, 577], [349, 1240], [349, 1250], [349, 1252], [350, 577], [350, 1240], [350, 1250], [350, 1252], [351, 114], [351, 115], [351, 819], [352, 415], [352, 496], [352, 503], [352, 580], [353, 150], [353, 222], [353, 415], [353, 496], [353, 501], [353, 580], [353, 706], [354, 415], [354, 496], [354, 501], [354, 580], [354, 706], [354, 1050], [354, 1053], [354, 1057], [355, 415], [355, 496], [355, 503], [355, 580], [356, 813], [356, 817], [356, 821], [360, 106], [360, 849], [360, 924], [361, 415], [361, 423], [361, 491], [361, 492], [361, 580], [362, 415], [362, 423], [362, 491], [362, 492], [362, 580], [363, 415], [363, 423], [363, 491], [363, 492], [363, 580], [364, 129], [364, 415], [364, 423], [364, 483], [364, 503], [364, 504], [364, 512], [364, 580], [364, 706], [364, 859], [364, 860], [365, 415], [365, 423], [365, 503], [365, 504], [365, 580], [365, 859], [365, 860], [366, 129], [366, 415], [366, 423], [366, 483], [366, 503], [366, 504], [366, 512], [366, 580], [366, 706], [366, 859], [366, 860], [367, 415], [367, 423], [367, 501], [367, 580], [368, 415], [368, 423], [368, 501], [368, 580], [368, 712], [368, 714], [368, 881], [368, 882], [369, 415], [369, 423], [369, 501], [369, 580], [372, 0], [372, 29], [372, 30], [372, 42], [372, 43], [372, 46], [372, 47], [372, 48], [372, 51], [372, 91], [372, 103], [372, 121], [372, 122], [372, 175], [372, 182], [372, 183], [372, 184], [372, 185], [372, 186], [372, 204], [372, 205], [372, 223], [372, 246], [372, 248], [372, 271], [372, 281], [372, 284], [372, 349], [372, 350], [372, 353], [372, 370], [372, 404], [372, 406], [372, 407], [372, 424], [372, 446], [372, 448], [372, 449], [372, 456], [372, 489], [372, 505], [372, 510], [372, 547], [372, 550], [372, 557], [372, 559], [372, 564], [372, 565], [372, 569], [372, 571], [372, 572], [372, 603], [372, 606], [372, 607], [372, 610], [372, 626], [372, 627], [372, 629], [372, 630], [372, 631], [372, 634], [372, 636], [372, 644], [372, 653], [372, 689], [372, 691], [372, 694], [372, 699], [372, 704], [372, 705], [372, 711], [372, 712], [372, 713], [372, 714], [372, 775], [372, 786], [372, 789], [372, 790], [372, 792], [372, 793], [372, 797], [372, 799], [372, 801], [372, 802], [372, 804], [372, 806], [372, 807], [372, 808], [372, 809], [372, 810], [372, 812], [372, 819], [372, 833], [372, 855], [372, 874], [372, 877], [372, 897], [372, 898], [372, 899], [372, 906], [372, 908], [372, 911], [372, 916], [372, 921], [372, 944], [372, 952], [372, 972], [372, 978], [372, 1010], [372, 1106], [372, 1123], [372, 1128], [372, 1129], [372, 1131], [372, 1133], [372, 1135], [372, 1138], [372, 1155], [372, 1167], [372, 1177], [372, 1178], [372, 1188], [372, 1215], [372, 1216], [372, 1218], [372, 1220], [372, 1232], [372, 1234], [372, 1239], [372, 1256], [372, 1258], [372, 1264], [373, 106], [378, 314], [378, 317], [378, 385], [378, 393], [378, 577], [387, 21], [387, 736], [389, 917], [389, 919], [389, 1191], [391, 819], [392, 442], [392, 926], [394, 757], [398, 417], [406, 923], [407, 923], [408, 923], [409, 923], [410, 923], [411, 141], [411, 145], [411, 148], [411, 161], [411, 162], [411, 172], [411, 174], [411, 542], [411, 547], [411, 550], [411, 978], [411, 1002], [412, 881], [412, 882], [414, 691], [414, 760], [414, 761], [415, 85], [415, 88], [415, 691], [415, 760], [415, 761], [416, 757], [416, 814], [416, 821], [416, 940], [417, 407], [417, 819], [418, 938], [419, 51], [419, 91], [419, 103], [419, 139], [419, 233], [419, 235], [419, 248], [419, 296], [419, 307], [419, 354], [419, 356], [419, 358], [419, 413], [419, 448], [419, 449], [419, 456], [419, 488], [419, 505], [419, 510], [419, 620], [419, 652], [419, 691], [419, 705], [419, 711], [419, 775], [419, 876], [419, 899], [419, 902], [419, 904], [419, 905], [419, 912], [419, 915], [419, 941], [419, 944], [419, 945], [419, 946], [419, 974], [419, 979], [419, 981], [419, 982], [419, 1034], [419, 1090], [419, 1109], [419, 1110], [419, 1130], [419, 1131], [419, 1136], [419, 1170], [419, 1192], [419, 1193], [419, 1209], [419, 1219], [419, 1220], [420, 51], [420, 91], [420, 103], [420, 139], [420, 233], [420, 235], [420, 248], [420, 296], [420, 307], [420, 413], [420, 448], [420, 449], [420, 456], [420, 488], [420, 505], [420, 510], [420, 620], [420, 652], [420, 691], [420, 705], [420, 711], [420, 775], [420, 899], [420, 902], [420, 905], [420, 912], [420, 915], [420, 941], [420, 944], [420, 945], [420, 946], [420, 974], [420, 979], [420, 981], [420, 982], [420, 1034], [420, 1090], [420, 1109], [420, 1110], [420, 1130], [420, 1131], [420, 1136], [420, 1156], [420, 1160], [420, 1170], [420, 1192], [420, 1193], [420, 1209], [420, 1219], [420, 1220], [421, 51], [421, 91], [421, 103], [421, 139], [421, 233], [421, 235], [421, 248], [421, 296], [421, 307], [421, 354], [421, 356], [421, 358], [421, 413], [421, 448], [421, 449], [421, 456], [421, 488], [421, 505], [421, 510], [421, 652], [421, 691], [421, 705], [421, 711], [421, 775], [421, 876], [421, 899], [421, 902], [421, 904], [421, 905], [421, 912], [421, 915], [421, 941], [421, 944], [421, 945], [421, 946], [421, 974], [421, 979], [421, 981], [421, 982], [421, 1034], [421, 1090], [421, 1109], [421, 1110], [421, 1130], [421, 1131], [421, 1136], [421, 1170], [421, 1192], [421, 1193], [421, 1209], [421, 1219], [421, 1220], [422, 51], [422, 91], [422, 103], [422, 139], [422, 233], [422, 235], [422, 248], [422, 296], [422, 307], [422, 354], [422, 356], [422, 358], [422, 413], [422, 448], [422, 449], [422, 456], [422, 488], [422, 505], [422, 510], [422, 652], [422, 691], [422, 705], [422, 711], [422, 775], [422, 876], [422, 899], [422, 902], [422, 904], [422, 905], [422, 912], [422, 915], [422, 941], [422, 944], [422, 945], [422, 946], [422, 974], [422, 979], [422, 981], [422, 982], [422, 1034], [422, 1090], [422, 1109], [422, 1110], [422, 1130], [422, 1131], [422, 1136], [422, 1170], [422, 1192], [422, 1193], [422, 1209], [422, 1219], [422, 1220], [423, 83], [423, 85], [423, 88], [423, 129], [424, 83], [424, 85], [424, 88], [424, 314], [424, 757], [424, 1158], [424, 1224], [425, 83], [425, 85], [425, 88], [425, 780], [425, 783], [425, 880], [426, 83], [426, 85], [426, 88], [427, 83], [427, 85], [427, 88], [430, 984], [430, 1012], [433, 76], [433, 123], [433, 131], [433, 257], [433, 258], [433, 280], [433, 282], [433, 325], [433, 337], [433, 379], [433, 380], [433, 411], [433, 412], [433, 421], [433, 428], [433, 506], [433, 696], [433, 772], [433, 821], [433, 1081], [433, 1083], [433, 1142], [433, 1143], [433, 1144], [433, 1149], [433, 1161], [433, 1162], [433, 1183], [433, 1194], [433, 1223], [433, 1226], [433, 1227], [434, 1019], [434, 1021], [435, 264], [435, 276], [435, 372], [435, 415], [435, 422], [435, 491], [435, 503], [435, 580], [436, 923], [437, 415], [437, 422], [437, 491], [437, 580], [437, 881], [437, 882], [438, 415], [438, 422], [438, 503], [438, 580], [439, 691], [439, 760], [439, 761], [440, 454], [440, 819], [440, 984], [440, 1012], [441, 106], [441, 454], [441, 819], [441, 924], [442, 66], [442, 247], [442, 350], [442, 351], [442, 353], [442, 376], [442, 693], [442, 788], [442, 789], [442, 811], [442, 812], [442, 1023], [442, 1048], [443, 94], [443, 115], [443, 308], [443, 344], [443, 622], [443, 696], [443, 819], [444, 13], [444, 16], [444, 89], [444, 129], [444, 245], [444, 290], [444, 293], [444, 349], [444, 369], [444, 478], [444, 503], [444, 512], [444, 592], [444, 617], [444, 621], [444, 627], [444, 644], [444, 944], [444, 1050], [444, 1057], [444, 1059], [444, 1187], [444, 1188], [445, 514], [445, 1262], [447, 217], [447, 633], [447, 637], [450, 264], [450, 308], [450, 309], [450, 311], [450, 312], [450, 313], [451, 264], [451, 308], [451, 309], [451, 311], [451, 312], [451, 313], [454, 28], [454, 442], [454, 757], [454, 859], [454, 926], [456, 1156], [456, 1164], [461, 413], [461, 655], [461, 763], [466, 170], [466, 213], [466, 735], [467, 344], [467, 429], [467, 430], [467, 819], [467, 833], [467, 1110], [467, 1208], [468, 344], [468, 429], [468, 430], [468, 819], [468, 833], [468, 1110], [468, 1208], [469, 308], [469, 311], [469, 548], [469, 550], [469, 920], [469, 977], [474, 42], [474, 43], [474, 314], [474, 360], [474, 564], [474, 632], [474, 1158], [474, 1224], [475, 106], [475, 579], [476, 106], [476, 579], [477, 1181], [478, 106], [478, 579], [479, 106], [479, 579], [480, 106], [480, 579], [481, 106], [481, 579], [482, 106], [482, 579], [483, 917], [483, 1181], [484, 1181], [486, 954], [486, 960], [486, 987], [487, 242], [487, 243], [487, 299], [487, 492], [487, 843], [487, 939], [487, 954], [487, 955], [487, 956], [492, 18], [492, 19], [492, 20], [492, 129], [492, 424], [492, 443], [492, 480], [492, 512], [496, 314], [496, 1151], [496, 1224], [497, 217], [497, 360], [497, 433], [497, 434], [497, 435], [497, 478], [497, 564], [497, 617], [497, 619], [497, 633], [497, 637], [497, 691], [497, 760], [497, 761], [497, 788], [497, 789], [503, 94], [503, 97], [503, 308], [503, 821], [504, 249], [504, 821], [504, 927], [505, 257], [505, 337], [505, 772], [506, 249], [506, 927], [507, 238], [507, 240], [507, 244], [507, 257], [507, 337], [507, 772], [507, 927], [507, 1117], [508, 238], [508, 240], [508, 244], [508, 927], [509, 238], [509, 240], [509, 244], [509, 257], [509, 322], [509, 327], [509, 337], [509, 609], [509, 611], [509, 772], [509, 927], [509, 936], [509, 945], [510, 238], [510, 240], [510, 244], [510, 257], [510, 337], [510, 772], [510, 927], [513, 238], [513, 240], [513, 244], [513, 927], [514, 814], [514, 821], [514, 940], [515, 308], [515, 614], [516, 308], [516, 614], [517, 308], [517, 614], [518, 0], [518, 1], [518, 10], [518, 25], [518, 40], [518, 51], [518, 71], [518, 103], [518, 139], [518, 219], [518, 245], [518, 248], [518, 257], [518, 266], [518, 271], [518, 274], [518, 304], [518, 339], [518, 409], [518, 413], [518, 425], [518, 449], [518, 451], [518, 452], [518, 453], [518, 470], [518, 479], [518, 550], [518, 556], [518, 559], [518, 560], [518, 565], [518, 591], [518, 603], [518, 652], [518, 654], [518, 691], [518, 701], [518, 748], [518, 768], [518, 769], [518, 775], [518, 797], [518, 799], [518, 802], [518, 859], [518, 860], [518, 870], [518, 884], [518, 894], [518, 898], [518, 905], [518, 916], [518, 937], [518, 944], [518, 945], [518, 947], [518, 949], [518, 972], [518, 1010], [518, 1011], [518, 1019], [518, 1033], [518, 1081], [518, 1095], [518, 1106], [518, 1123], [518, 1126], [518, 1197], [518, 1205], [518, 1206], [518, 1207], [519, 51], [519, 139], [519, 149], [519, 339], [519, 401], [519, 403], [519, 691], [519, 701], [519, 944], [520, 0], [520, 1], [520, 2], [520, 10], [520, 25], [520, 40], [520, 51], [520, 71], [520, 139], [520, 219], [520, 245], [520, 248], [520, 266], [520, 271], [520, 304], [520, 339], [520, 343], [520, 413], [520, 425], [520, 449], [520, 451], [520, 452], [520, 453], [520, 470], [520, 479], [520, 565], [520, 591], [520, 603], [520, 652], [520, 654], [520, 691], [520, 701], [520, 768], [520, 769], [520, 775], [520, 797], [520, 799], [520, 802], [520, 850], [520, 851], [520, 884], [520, 894], [520, 898], [520, 905], [520, 916], [520, 944], [520, 945], [520, 947], [520, 949], [520, 1011], [520, 1019], [520, 1033], [520, 1081], [520, 1095], [520, 1106], [520, 1110], [520, 1123], [520, 1126], [520, 1169], [520, 1209], [521, 0], [521, 1], [521, 10], [521, 25], [521, 40], [521, 51], [521, 139], [521, 219], [521, 245], [521, 266], [521, 304], [521, 339], [521, 413], [521, 449], [521, 451], [521, 452], [521, 453], [521, 470], [521, 479], [521, 565], [521, 591], [521, 603], [521, 652], [521, 654], [521, 691], [521, 701], [521, 768], [521, 769], [521, 775], [521, 797], [521, 799], [521, 802], [521, 884], [521, 894], [521, 898], [521, 905], [521, 916], [521, 944], [521, 945], [521, 947], [521, 949], [521, 1011], [521, 1019], [521, 1033], [521, 1081], [521, 1095], [521, 1106], [521, 1110], [521, 1123], [521, 1126], [521, 1208], [523, 226], [523, 757], [523, 997], [524, 107], [524, 217], [524, 226], [524, 264], [524, 324], [524, 1191], [525, 226], [526, 28], [526, 112], [526, 192], [526, 226], [526, 227], [526, 244], [526, 328], [526, 330], [526, 442], [526, 859], [526, 926], [526, 927], [526, 931], [526, 1098], [526, 1106], [526, 1117], [526, 1119], [527, 420], [529, 819], [529, 1191], [530, 308], [530, 311], [530, 609], [530, 611], [530, 821], [530, 945], [531, 609], [531, 611], [531, 945], [532, 609], [532, 611], [532, 945], [533, 308], [533, 311], [533, 1191], [534, 254], [534, 256], [534, 257], [535, 254], [535, 256], [535, 257], [536, 19], [536, 20], [536, 308], [536, 311], [536, 478], [536, 540], [536, 1191], [537, 308], [537, 311], [538, 465], [538, 519], [538, 936], [538, 954], [538, 1009], [538, 1012], [538, 1013], [538, 1088], [538, 1089], [539, 519], [539, 757], [540, 519], [541, 454], [541, 819], [542, 17], [542, 19], [542, 20], [542, 900], [543, 818], [543, 819], [544, 819], [545, 609], [545, 611], [545, 945], [546, 819], [547, 28], [547, 757], [547, 813], [547, 815], [547, 817], [547, 821], [547, 859], [548, 690], [548, 696], [548, 813], [548, 815], [548, 817], [548, 821], [549, 757], [549, 813], [549, 815], [549, 817], [549, 821], [550, 427], [550, 428], [550, 543], [550, 544], [550, 696], [551, 543], [551, 544], [552, 543], [552, 544], [553, 427], [553, 428], [553, 543], [553, 544], [553, 696], [554, 427], [554, 428], [554, 543], [554, 544], [554, 696], [555, 427], [555, 428], [555, 543], [555, 544], [555, 696], [556, 427], [556, 428], [556, 543], [556, 544], [556, 696], [560, 427], [560, 428], [560, 543], [560, 544], [560, 696], [561, 427], [561, 428], [561, 543], [561, 544], [561, 696], [562, 543], [562, 544], [562, 545], [563, 427], [563, 428], [563, 543], [563, 544], [563, 696], [564, 427], [564, 428], [564, 543], [564, 544], [564, 696], [565, 427], [565, 428], [565, 543], [565, 544], [565, 696], [566, 270], [566, 691], [566, 1090], [568, 845], [569, 845], [571, 845], [574, 741], [574, 828], [576, 217], [576, 360], [576, 433], [576, 434], [576, 435], [576, 564], [576, 633], [576, 637], [576, 788], [576, 789], [578, 322], [578, 936], [578, 975], [578, 976], [579, 322], [579, 936], [581, 321], [581, 322], [581, 550], [581, 748], [581, 936], [581, 975], [581, 976], [582, 322], [582, 936], [583, 321], [583, 322], [583, 547], [583, 550], [583, 748], [583, 757], [583, 936], [583, 975], [583, 976], [584, 321], [584, 322], [584, 936], [584, 976], [585, 322], [585, 936], [586, 83], [586, 85], [586, 88], [586, 124], [586, 903], [586, 928], [587, 141], [587, 145], [587, 148], [587, 161], [587, 162], [587, 172], [587, 542], [587, 547], [587, 550], [587, 978], [590, 124], [591, 781], [591, 783], [593, 894], [593, 947], [593, 954], [593, 958], [594, 894], [594, 947], [598, 1110], [598, 1208], [600, 108], [600, 109], [600, 110], [600, 823], [600, 825], [600, 826], [600, 827], [600, 1194], [600, 1226], [601, 238], [601, 240], [601, 244], [601, 465], [601, 927], [601, 936], [601, 984], [601, 1012], [602, 442], [602, 926], [603, 328], [603, 330], [604, 126], [605, 407], [605, 819], [606, 819], [607, 543], [607, 544], [607, 545], [608, 442], [608, 926], [609, 246], [609, 248], [609, 250], [609, 271], [609, 573], [609, 576], [609, 578], [609, 691], [609, 921], [609, 1106], [609, 1123], [612, 544], [612, 598], [612, 950], [612, 951], [613, 269], [613, 946], [614, 269], [614, 946], [617, 954], [617, 958], [617, 968], [621, 192], [621, 253], [621, 256], [621, 257], [621, 395], [621, 696], [621, 933], [623, 91], [623, 289], [623, 505], [623, 510], [623, 1130], [623, 1131], [624, 289], [625, 289], [626, 106], [626, 925], [627, 106], [627, 925], [628, 106], [628, 757], [628, 925], [629, 882], [630, 454], [630, 819], [631, 442], [631, 926], [632, 903], [632, 928], [633, 903], [633, 928], [634, 903], [634, 928], [635, 903], [635, 928], [636, 903], [636, 928], [640, 65], [640, 181], [640, 182], [640, 184], [640, 185], [640, 186], [640, 196], [640, 197], [640, 200], [640, 350], [640, 353], [640, 355], [640, 356], [640, 786], [640, 789], [640, 792], [640, 793], [640, 801], [640, 802], [640, 804], [640, 811], [640, 812], [640, 876], [640, 1068], [640, 1078], [640, 1177], [640, 1178], [641, 65], [641, 181], [641, 182], [641, 184], [641, 185], [641, 186], [641, 196], [641, 197], [641, 200], [641, 350], [641, 353], [641, 355], [641, 356], [641, 786], [641, 789], [641, 792], [641, 793], [641, 801], [641, 802], [641, 804], [641, 811], [641, 812], [641, 876], [641, 1068], [641, 1078], [641, 1177], [641, 1178], [642, 65], [642, 181], [642, 182], [642, 184], [642, 185], [642, 186], [642, 196], [642, 197], [642, 200], [642, 350], [642, 353], [642, 355], [642, 356], [642, 786], [642, 789], [642, 792], [642, 793], [642, 801], [642, 802], [642, 804], [642, 811], [642, 812], [642, 876], [642, 1068], [642, 1078], [642, 1177], [642, 1178], [643, 1177], [643, 1178], [644, 65], [644, 181], [644, 182], [644, 184], [644, 185], [644, 186], [644, 196], [644, 197], [644, 200], [644, 350], [644, 353], [644, 355], [644, 356], [644, 786], [644, 789], [644, 792], [644, 793], [644, 801], [644, 802], [644, 804], [644, 811], [644, 812], [644, 876], [644, 1068], [644, 1078], [645, 65], [645, 181], [645, 182], [645, 184], [645, 185], [645, 186], [645, 196], [645, 197], [645, 200], [645, 350], [645, 353], [645, 355], [645, 356], [645, 786], [645, 789], [645, 792], [645, 793], [645, 801], [645, 802], [645, 804], [645, 811], [645, 812], [645, 876], [645, 1068], [645, 1078], [646, 65], [646, 181], [646, 182], [646, 184], [646, 185], [646, 186], [646, 196], [646, 197], [646, 200], [646, 350], [646, 353], [646, 355], [646, 356], [646, 786], [646, 789], [646, 792], [646, 793], [646, 801], [646, 802], [646, 804], [646, 811], [646, 812], [646, 876], [646, 1068], [646, 1078], [646, 1177], [646, 1178], [647, 65], [647, 181], [647, 182], [647, 184], [647, 185], [647, 186], [647, 196], [647, 197], [647, 200], [647, 350], [647, 353], [647, 355], [647, 356], [647, 786], [647, 789], [647, 792], [647, 793], [647, 801], [647, 802], [647, 804], [647, 811], [647, 812], [647, 876], [647, 1068], [647, 1078], [647, 1177], [647, 1178], [648, 65], [648, 181], [648, 182], [648, 184], [648, 185], [648, 186], [648, 196], [648, 197], [648, 200], [648, 350], [648, 353], [648, 355], [648, 356], [648, 786], [648, 789], [648, 792], [648, 793], [648, 801], [648, 802], [648, 804], [648, 811], [648, 812], [648, 876], [648, 1068], [648, 1078], [648, 1177], [648, 1178], [649, 65], [649, 181], [649, 182], [649, 184], [649, 185], [649, 186], [649, 196], [649, 197], [649, 200], [649, 350], [649, 353], [649, 355], [649, 356], [649, 786], [649, 789], [649, 792], [649, 793], [649, 801], [649, 802], [649, 804], [649, 811], [649, 812], [649, 876], [649, 1068], [649, 1078], [649, 1177], [649, 1178], [650, 91], [650, 307], [650, 505], [650, 510], [650, 1100], [653, 288], [653, 306], [653, 699], [653, 705], [654, 288], [654, 306], [655, 288], [655, 306], [658, 192], [658, 929], [658, 931], [658, 945], [658, 981], [659, 91], [659, 192], [659, 264], [659, 314], [659, 441], [659, 505], [659, 510], [659, 929], [659, 931], [659, 1130], [659, 1131], [659, 1158], [659, 1200], [659, 1224], [664, 267], [664, 420], [664, 538], [664, 544], [664, 777], [664, 1008], [665, 267], [665, 420], [665, 538], [665, 544], [665, 777], [665, 1008], [666, 91], [666, 267], [666, 420], [666, 505], [666, 510], [666, 538], [666, 544], [666, 777], [666, 1008], [666, 1131], [666, 1139], [672, 954], [672, 960], [673, 593], [678, 353], [678, 375], [678, 376], [678, 789], [678, 954], [678, 959], [678, 963], [682, 264], [709, 954], [709, 1087], [709, 1088], [709, 1089], [711, 894], [711, 947], [712, 104], [712, 179], [712, 207], [712, 267], [712, 297], [712, 544], [712, 842], [712, 1008], [752, 921], [759, 833], [759, 1256], [759, 1258], [760, 939], [760, 954], [760, 955], [760, 956], [761, 364], [761, 1081], [761, 1111], [761, 1150], [761, 1190], [762, 364], [762, 1081], [762, 1111], [762, 1150], [762, 1190], [763, 364], [763, 444], [763, 1081], [763, 1111], [763, 1150], [763, 1190], [764, 364], [764, 1081], [764, 1111], [764, 1150], [764, 1190], [765, 364], [765, 1081], [765, 1111], [765, 1150], [765, 1190], [766, 364], [766, 1081], [766, 1111], [766, 1143], [766, 1144], [766, 1150], [766, 1190], [767, 364], [767, 757], [767, 1066], [767, 1081], [767, 1111], [767, 1141], [767, 1143], [767, 1144], [767, 1145], [767, 1150], [767, 1190], [768, 364], [768, 1081], [768, 1111], [768, 1150], [768, 1190], [770, 364], [770, 442], [770, 926], [770, 1081], [770, 1111], [770, 1150], [770, 1190], [771, 364], [771, 1081], [771, 1111], [771, 1150], [771, 1190], [772, 559], [778, 276], [778, 372], [778, 757], [779, 600], [779, 1168], [780, 600], [780, 1168], [783, 415], [783, 422], [783, 478], [783, 491], [783, 503], [783, 540], [783, 550], [783, 580], [783, 748], [787, 478], [787, 540], [787, 548], [787, 550], [787, 757], [787, 920], [787, 977], [787, 1205], [787, 1211], [791, 28], [791, 859], [792, 478], [792, 540], [799, 308], [799, 311], [799, 757], [799, 819], [800, 308], [800, 311], [801, 308], [801, 311], [803, 256], [803, 257], [806, 121], [806, 122], [806, 135], [806, 136], [806, 268], [806, 320], [806, 527], [806, 528], [808, 121], [808, 122], [808, 135], [808, 136], [808, 268], [808, 320], [808, 527], [808, 528], [809, 268], [809, 527], [810, 121], [810, 122], [810, 135], [810, 136], [810, 268], [810, 320], [810, 527], [810, 528], [810, 757], [811, 121], [811, 122], [811, 135], [811, 136], [811, 268], [811, 320], [811, 527], [811, 528], [812, 121], [812, 122], [812, 135], [812, 136], [812, 268], [812, 320], [812, 527], [812, 528], [813, 121], [813, 122], [813, 135], [813, 136], [813, 268], [813, 320], [813, 527], [813, 528], [814, 121], [814, 122], [814, 135], [814, 136], [814, 268], [814, 320], [814, 527], [814, 528], [815, 18], [815, 19], [815, 20], [815, 121], [815, 122], [815, 135], [815, 136], [815, 150], [815, 192], [815, 222], [815, 248], [815, 320], [815, 365], [815, 420], [815, 448], [815, 477], [815, 480], [815, 489], [815, 495], [815, 530], [815, 584], [815, 881], [815, 882], [815, 886], [815, 932], [815, 933], [815, 1072], [815, 1194], [815, 1227], [816, 18], [816, 19], [816, 20], [816, 121], [816, 122], [816, 135], [816, 136], [816, 150], [816, 192], [816, 222], [816, 248], [816, 320], [816, 365], [816, 420], [816, 448], [816, 477], [816, 480], [816, 489], [816, 495], [816, 530], [816, 584], [816, 757], [816, 881], [816, 882], [816, 886], [816, 932], [816, 933], [816, 1072], [816, 1194], [816, 1227], [817, 18], [817, 19], [817, 20], [817, 121], [817, 122], [817, 135], [817, 136], [817, 150], [817, 192], [817, 222], [817, 248], [817, 320], [817, 365], [817, 420], [817, 448], [817, 477], [817, 480], [817, 489], [817, 495], [817, 530], [817, 584], [817, 881], [817, 882], [817, 886], [817, 932], [817, 933], [817, 1072], [817, 1194], [817, 1227], [818, 18], [818, 19], [818, 20], [818, 105], [818, 121], [818, 122], [818, 135], [818, 136], [818, 150], [818, 192], [818, 222], [818, 248], [818, 320], [818, 365], [818, 420], [818, 448], [818, 477], [818, 480], [818, 489], [818, 495], [818, 530], [818, 584], [818, 881], [818, 882], [818, 886], [818, 932], [818, 933], [818, 1072], [818, 1194], [818, 1227], [819, 18], [819, 19], [819, 20], [819, 121], [819, 122], [819, 135], [819, 136], [819, 150], [819, 192], [819, 222], [819, 248], [819, 320], [819, 365], [819, 420], [819, 448], [819, 477], [819, 480], [819, 489], [819, 495], [819, 530], [819, 584], [819, 881], [819, 882], [819, 886], [819, 932], [819, 933], [819, 1072], [819, 1194], [819, 1227], [820, 268], [820, 528], [820, 691], [820, 760], [820, 761], [823, 461], [823, 462], [825, 268], [825, 528], [827, 268], [827, 527], [827, 528], [828, 268], [828, 527], [828, 528], [829, 268], [829, 527], [830, 268], [830, 527], [835, 0], [835, 1], [835, 12], [835, 413], [835, 603], [835, 655], [835, 757], [835, 922], [836, 17], [836, 18], [836, 19], [836, 20], [836, 318], [836, 536], [836, 754], [836, 755], [836, 1016], [837, 20], [837, 754], [837, 755], [838, 20], [838, 754], [838, 755], [839, 718], [839, 722], [839, 845], [840, 409], [840, 410], [840, 414], [840, 691], [840, 699], [840, 700], [840, 705], [840, 759], [840, 760], [840, 761], [840, 859], [840, 860], [843, 0], [843, 11], [843, 246], [843, 248], [843, 250], [843, 271], [843, 425], [843, 573], [843, 576], [843, 578], [843, 603], [843, 691], [843, 712], [843, 715], [843, 854], [847, 1148], [848, 757], [848, 832], [848, 833], [849, 9], [849, 658], [849, 841], [849, 845], [849, 846], [851, 45], [851, 50], [851, 103], [851, 243], [851, 259], [851, 260], [851, 299], [851, 300], [851, 316], [851, 361], [851, 365], [851, 371], [851, 477], [851, 691], [851, 843], [851, 946], [851, 953], [851, 970], [851, 972], [851, 1148], [851, 1192], [852, 45], [852, 50], [852, 103], [852, 243], [852, 259], [852, 260], [852, 299], [852, 300], [852, 316], [852, 361], [852, 365], [852, 371], [852, 477], [852, 691], [852, 843], [852, 946], [852, 953], [852, 970], [852, 972], [852, 1148], [852, 1192], [854, 0], [854, 1], [854, 12], [854, 115], [854, 603], [854, 819], [857, 415], [857, 422], [857, 503], [857, 580], [858, 415], [858, 422], [858, 503], [858, 580], [860, 28], [860, 442], [860, 859], [860, 926], [862, 28], [862, 62], [862, 192], [862, 257], [862, 264], [862, 328], [862, 330], [862, 337], [862, 381], [862, 442], [862, 446], [862, 634], [862, 636], [862, 772], [862, 859], [862, 926], [862, 930], [862, 931], [862, 933], [862, 1099], [862, 1148], [862, 1194], [862, 1225], [862, 1226], [862, 1228], [862, 1229], [864, 192], [864, 257], [864, 264], [864, 337], [864, 442], [864, 772], [864, 926], [864, 930], [864, 931], [865, 192], [865, 257], [865, 337], [865, 772], [865, 929], [865, 930], [865, 931], [865, 1148], [866, 192], [866, 264], [866, 442], [866, 926], [866, 929], [866, 931], [867, 172], [867, 192], [867, 257], [867, 288], [867, 330], [867, 337], [867, 381], [867, 442], [867, 498], [867, 526], [867, 710], [867, 772], [867, 881], [867, 882], [867, 926], [867, 930], [867, 931], [867, 932], [867, 933], [867, 1099], [875, 121], [875, 122], [875, 205], [878, 192], [878, 933], [879, 192], [879, 930], [879, 933], [879, 945], [879, 981], [879, 982], [881, 192], [881, 257], [881, 337], [881, 772], [881, 929], [881, 930], [881, 931], [881, 945], [881, 981], [881, 982], [882, 192], [882, 257], [882, 337], [882, 772], [882, 930], [882, 931], [883, 192], [883, 930], [883, 933], [883, 945], [883, 981], [883, 982], [884, 513], [884, 514], [884, 945], [884, 981], [884, 982], [885, 45], [885, 50], [885, 192], [885, 257], [885, 330], [885, 337], [885, 381], [885, 442], [885, 772], [885, 885], [885, 926], [885, 930], [885, 931], [885, 933], [885, 945], [885, 981], [885, 982], [885, 1148], [886, 192], [886, 931], [887, 28], [887, 859], [888, 328], [888, 330], [888, 442], [888, 926], [895, 257], [895, 337], [895, 772], [896, 107], [896, 217], [896, 918], [897, 28], [897, 107], [897, 217], [897, 859], [897, 918], [899, 28], [899, 76], [899, 141], [899, 145], [899, 148], [899, 161], [899, 162], [899, 170], [899, 172], [899, 174], [899, 268], [899, 380], [899, 415], [899, 422], [899, 442], [899, 491], [899, 503], [899, 527], [899, 542], [899, 547], [899, 550], [899, 580], [899, 597], [899, 735], [899, 859], [899, 867], [899, 883], [899, 926], [899, 978], [899, 1002], [899, 1012], [899, 1013], [899, 1045], [899, 1050], [899, 1054], [899, 1066], [899, 1113], [899, 1141], [899, 1143], [899, 1144], [899, 1148], [899, 1191], [901, 0], [901, 601], [901, 603], [903, 106], [903, 696], [903, 757], [903, 925], [905, 525], [905, 541], [906, 541], [907, 541], [908, 541], [910, 525], [910, 541], [911, 525], [911, 541], [912, 525], [912, 541], [913, 541], [914, 541], [915, 541], [916, 396], [916, 541], [916, 1106], [917, 541], [919, 730], [919, 737], [919, 738], [919, 739], [919, 740], [919, 823], [919, 827], [919, 845], [919, 1194], [919, 1226], [920, 247], [920, 374], [920, 399], [920, 447], [920, 490], [920, 646], [920, 647], [920, 712], [920, 714], [920, 898], [920, 909], [920, 910], [921, 691], [921, 698], [921, 699], [921, 700], [921, 702], [921, 705], [921, 759], [921, 760], [921, 761], [922, 870], [922, 939], [922, 954], [922, 957], [922, 958], [923, 939], [923, 954], [923, 957], [923, 958], [923, 968], [924, 939], [924, 954], [924, 957], [924, 958], [924, 968], [925, 150], [925, 222], [925, 261], [925, 983], [926, 267], [926, 544], [926, 777], [926, 779], [926, 783], [926, 880], [926, 1008], [927, 51], [927, 133], [927, 198], [927, 203], [927, 211], [927, 266], [927, 267], [927, 297], [927, 339], [927, 340], [927, 544], [927, 691], [927, 699], [927, 705], [927, 726], [927, 881], [927, 882], [927, 905], [927, 944], [927, 945], [927, 949], [927, 1008], [927, 1033], [927, 1106], [927, 1114], [927, 1123], [927, 1129], [929, 1177], [929, 1178], [930, 87], [930, 88], [930, 121], [930, 122], [930, 135], [930, 136], [930, 142], [930, 143], [930, 267], [930, 268], [930, 320], [930, 527], [930, 528], [930, 544], [930, 548], [930, 550], [930, 777], [930, 779], [930, 781], [930, 783], [930, 880], [930, 920], [930, 977], [930, 1008], [931, 87], [931, 88], [931, 143], [931, 267], [931, 544], [931, 777], [931, 779], [931, 783], [931, 880], [931, 1008], [932, 217], [932, 267], [932, 544], [932, 633], [932, 638], [932, 639], [932, 777], [932, 779], [932, 783], [932, 880], [932, 1008], [933, 267], [933, 544], [933, 777], [933, 779], [933, 783], [933, 880], [933, 1008], [934, 773], [934, 878], [934, 882], [934, 947], [935, 267], [935, 438], [935, 440], [935, 544], [935, 777], [935, 779], [935, 783], [935, 880], [935, 882], [935, 1008], [936, 267], [936, 544], [936, 777], [936, 779], [936, 783], [936, 880], [936, 954], [936, 957], [936, 1008], [937, 267], [937, 544], [937, 777], [937, 779], [937, 783], [937, 880], [937, 954], [937, 957], [937, 963], [937, 1008], [939, 461], [939, 462], 