{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 16868], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs", "optional": false}, "registered_name": null, "name": "inputs", "inbound_nodes": []}, {"module": "model.layers_custom", "class_name": "Diagonal", "config": {"name": "h0", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 8434, "activation": "tanh", "use_bias": true}, "registered_name": "Diagonal", "build_config": {"input_shape": [null, 16868]}, "name": "h0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16868], "dtype": "float32", "keras_history": ["inputs", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_0", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}, "registered_name": null, "name": "dropout_0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8434], "dtype": "float32", "keras_history": ["h0", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "model.layers_custom", "class_name": "SparseTF", "config": {"name": "h1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1268, "activation": "tanh", "use_bias": true, "nonzero_ind": {"class_name": "__numpy__", "config": {"value": [[12, 586], [12, 995], [13, 308], [13, 311], [16, 819], [17, 881], [17, 882], [18, 169], [18, 170], [18, 198], [18, 245], [18, 472], [18, 520], [18, 859], [19, 430], [19, 431], [19, 833], [21, 819], [22, 192], [22, 264], [22, 634], [22, 636], [22, 930], [22, 945], [22, 981], [22, 982], [23, 62], [23, 446], [23, 634], [23, 636], [24, 757], [25, 62], [25, 446], [26, 337], [26, 348], [26, 446], [27, 446], [27, 1117], [28, 446], [29, 112], [29, 238], [29, 240], [29, 244], [29, 634], [29, 636], [29, 927], [30, 264], [30, 446], [30, 634], [30, 636], [31, 446], [32, 446], [32, 634], [32, 636], [33, 446], [34, 446], [35, 226], [35, 227], [35, 446], [35, 634], [35, 636], [35, 1117], [35, 1119], [35, 1120], [36, 123], [36, 323], [36, 446], [36, 821], [36, 1117], [36, 1118], [36, 1120], [37, 20], [37, 56], [37, 57], [37, 129], [37, 512], [37, 634], [37, 636], [38, 62], [38, 446], [38, 939], [38, 954], [38, 956], [38, 1009], [38, 1012], [39, 32], [39, 833], [39, 989], [39, 994], [39, 1256], [40, 446], [41, 1106], [41, 1123], [41, 1129], [43, 146], [43, 226], [43, 227], [43, 519], [43, 997], [43, 1106], [43, 1117], [43, 1120], [43, 1123], [43, 1129], [44, 62], [44, 446], [45, 62], [45, 446], [45, 634], [45, 636], [45, 945], [45, 981], [45, 982], [46, 62], [46, 446], [46, 634], [46, 636], [46, 945], [46, 981], [46, 982], [48, 94], [48, 96], [48, 308], [51, 94], [51, 95], [51, 308], [52, 128], [52, 938], [53, 26], [53, 491], [53, 859], [54, 245], [54, 247], [54, 290], [54, 292], [54, 692], [54, 954], [54, 958], [54, 959], [54, 968], [54, 1050], [55, 245], [55, 247], [55, 290], [55, 292], [55, 692], [55, 954], [55, 958], [55, 959], [55, 968], [55, 1050], [57, 247], [57, 290], [57, 292], [57, 314], [57, 424], [57, 565], [57, 596], [57, 692], [57, 708], [57, 718], [57, 720], [57, 722], [57, 800], [57, 845], [57, 898], [57, 899], [57, 906], [57, 909], [57, 910], [57, 1050], [57, 1158], [57, 1181], [57, 1205], [57, 1211], [57, 1224], [58, 424], [58, 954], [58, 958], [58, 968], [58, 1011], [58, 1096], [59, 417], [60, 417], [61, 417], [65, 465], [65, 757], [65, 936], [65, 984], [65, 1012], [66, 864], [66, 936], [67, 67], [67, 734], [67, 758], [68, 864], [68, 936], [69, 264], [69, 864], [69, 936], [70, 818], [70, 819], [70, 1191], [73, 67], [73, 696], [73, 818], [73, 819], [73, 822], [73, 1191], [73, 1204], [74, 236], [74, 927], [75, 268], [75, 528], [76, 465], [76, 936], [76, 939], [76, 954], [76, 956], [76, 1009], [76, 1012], [77, 864], [77, 936], [80, 519], [81, 519], [82, 19], [82, 20], [82, 84], [82, 85], [82, 88], [82, 372], [82, 511], [84, 257], [84, 937], [84, 997], [85, 864], [85, 936], [86, 864], [86, 936], [87, 864], [87, 936], [88, 238], [88, 240], [88, 244], [88, 465], [88, 927], [88, 936], [88, 984], [88, 1012], [89, 465], [89, 936], [89, 984], [89, 1012], [90, 465], [90, 936], [92, 83], [92, 85], [92, 88], [95, 264], [95, 314], [95, 853], [95, 856], [95, 936], [95, 1158], [95, 1224], [96, 129], [96, 512], [96, 853], [96, 856], [96, 936], [97, 853], [97, 856], [97, 936], [98, 853], [98, 856], [98, 936], [99, 76], [99, 91], [99, 379], [99, 463], [99, 478], [99, 505], [99, 510], [99, 1131], [99, 1135], [99, 1223], [99, 1264], [100, 76], [100, 91], [100, 103], [100, 379], [100, 478], [100, 505], [100, 510], [100, 540], [100, 972], [100, 973], [100, 1131], [100, 1135], [100, 1223], [100, 1264], [101, 32], [101, 71], [101, 76], [101, 91], [101, 105], [101, 245], [101, 247], [101, 290], [101, 292], [101, 314], [101, 365], [101, 379], [101, 387], [101, 393], [101, 420], [101, 457], [101, 458], [101, 461], [101, 474], [101, 477], [101, 505], [101, 510], [101, 530], [101, 538], [101, 546], [101, 577], [101, 594], [101, 595], [101, 649], [101, 691], [101, 692], [101, 693], [101, 699], [101, 700], [101, 705], [101, 712], [101, 713], [101, 727], [101, 730], [101, 731], [101, 759], [101, 760], [101, 761], [101, 845], [101, 882], [101, 954], [101, 987], [101, 994], [101, 1050], [101, 1051], [101, 1055], [101, 1056], [101, 1110], [101, 1131], [101, 1135], [101, 1169], [101, 1181], [101, 1198], [101, 1203], [101, 1209], [101, 1223], [101, 1240], [101, 1241], [101, 1243], [101, 1244], [101, 1245], [101, 1246], [101, 1247], [101, 1257], [101, 1264], [103, 76], [103, 91], [103, 379], [103, 478], [103, 505], [103, 510], [103, 540], [103, 1131], [103, 1135], [103, 1223], [103, 1264], [104, 314], [104, 387], [104, 388], [104, 393], [104, 577], [104, 712], [104, 713], [104, 727], [104, 730], [104, 731], [104, 845], [104, 899], [104, 907], [104, 1110], [104, 1169], [104, 1198], [104, 1203], [104, 1209], [104, 1240], [104, 1241], [104, 1243], [104, 1244], [104, 1245], [104, 1246], [104, 1247], [105, 388], [105, 393], [105, 577], [105, 899], [105, 907], [105, 1240], [105, 1241], [105, 1247], [109, 18], [109, 19], [109, 20], [109, 28], [109, 91], [109, 418], [109, 463], [109, 478], [109, 531], [109, 532], [109, 535], [109, 536], [109, 537], [109, 699], [109, 705], [109, 859], [109, 1016], [109, 1025], [109, 1029], [110, 217], [110, 267], [110, 320], [110, 360], [110, 399], [110, 433], [110, 434], [110, 435], [110, 544], [110, 564], [110, 633], [110, 637], [110, 777], [110, 780], [110, 783], [110, 788], [110, 789], [110, 880], [110, 1008], [111, 320], [111, 757], [112, 247], [112, 290], [112, 292], [112, 365], [112, 474], [112, 692], [112, 757], [112, 882], [112, 1050], [113, 247], [113, 290], [113, 292], [113, 365], [113, 474], [113, 692], [113, 882], [113, 1050], [116, 34], [116, 92], [116, 946], [117, 34], [117, 92], [117, 269], [117, 946], [117, 1192], [118, 308], [118, 614], [118, 622], [118, 696], [118, 1117], [118, 1120], [119, 308], [119, 614], [121, 76], [121, 198], [122, 75], [122, 76], [123, 45], [123, 50], [123, 70], [123, 75], [123, 76], [123, 103], [123, 198], [123, 243], [123, 259], [123, 316], [123, 361], [123, 366], [123, 606], [123, 607], [123, 691], [123, 843], [123, 858], [123, 1050], [123, 1057], [123, 1172], [125, 76], [125, 91], [125, 505], [125, 510], [125, 1130], [125, 1131], [126, 35], [126, 74], [131, 35], [131, 74], [134, 75], [134, 76], [134, 757], [135, 70], [135, 75], [135, 76], [137, 428], [137, 464], [137, 583], [137, 586], [137, 696], [138, 428], [138, 464], [138, 583], [138, 586], [138, 696], [138, 857], [138, 1066], [138, 1143], [138, 1144], [139, 76], [139, 77], [139, 138], [139, 428], [139, 464], [139, 583], [139, 586], [139, 696], [140, 75], [140, 76], [140, 428], [140, 464], [140, 583], [140, 586], [140, 696], [141, 428], [141, 464], [141, 583], [141, 586], [141, 696], [142, 76], [142, 77], [142, 138], [142, 428], [142, 464], [142, 583], [142, 586], [142, 696], [143, 76], [143, 77], [143, 138], [143, 428], [143, 464], [143, 583], [143, 586], [143, 696], [144, 75], [144, 76], [144, 428], [144, 464], [144, 583], [144, 586], [144, 696], [145, 428], [145, 464], [145, 583], [145, 586], [145, 696], [146, 75], [146, 76], [146, 428], [146, 464], [146, 583], [146, 586], [146, 696], [147, 428], [147, 464], [147, 583], [147, 586], [147, 696], [148, 428], [148, 464], [148, 583], [148, 586], [148, 696], [149, 428], [149, 464], [149, 583], [149, 586], [149, 696], [150, 32], [150, 989], [150, 994], [150, 1184], [155, 13], [155, 14], [155, 15], [155, 16], [155, 18], [155, 19], [155, 20], [155, 89], [155, 127], [155, 129], [155, 134], [155, 501], [155, 503], [155, 504], [155, 525], [155, 531], [155, 536], [155, 541], [155, 607], [155, 631], [155, 944], [155, 1032], [155, 1050], [155, 1053], [155, 1057], [155, 1059], [155, 1152], [155, 1153], [155, 1205], [155, 1206], [156, 607], [156, 631], [157, 13], [157, 14], [157, 15], [157, 16], [157, 18], [157, 19], [157, 20], [157, 89], [157, 127], [157, 129], [157, 134], [157, 501], [157, 503], [157, 504], [157, 525], [157, 541], [157, 607], [157, 631], [157, 944], [157, 1032], [157, 1050], [157, 1053], [157, 1057], [157, 1059], [157, 1152], [157, 1153], [157, 1205], [157, 1206], [158, 13], [158, 14], [158, 15], [158, 16], [158, 18], [158, 19], [158, 20], [158, 89], [158, 127], [158, 129], [158, 134], [158, 444], [158, 501], [158, 503], [158, 504], [158, 525], [158, 541], [158, 607], [158, 631], [158, 944], [158, 1032], [158, 1050], [158, 1053], [158, 1057], [158, 1059], [158, 1152], [158, 1153], [158, 1205], [158, 1206], [159, 13], [159, 14], [159, 15], [159, 16], [159, 18], [159, 19], [159, 20], [159, 89], [159, 127], [159, 129], [159, 134], [159, 443], [159, 483], [159, 501], [159, 503], [159, 504], [159, 512], [159, 525], [159, 541], [159, 607], [159, 631], [159, 944], [159, 1032], [159, 1050], [159, 1053], [159, 1057], [159, 1059], [159, 1152], [159, 1153], [159, 1205], [159, 1206], [160, 13], [160, 14], [160, 15], [160, 16], [160, 18], [160, 19], [160, 20], [160, 89], [160, 127], [160, 129], [160, 134], [160, 443], [160, 501], [160, 503], [160, 504], [160, 512], [160, 525], [160, 531], [160, 536], [160, 541], [160, 607], [160, 631], [160, 944], [160, 1032], [160, 1050], [160, 1053], [160, 1057], [160, 1059], [160, 1152], [160, 1153], [160, 1205], [160, 1206], [161, 150], [161, 222], [161, 416], [161, 501], [161, 508], [161, 580], [162, 0], [162, 11], [162, 438], [162, 440], [162, 593], [162, 603], [162, 854], [163, 593], [164, 593], [164, 954], [164, 960], [164, 987], [165, 308], [165, 311], [165, 609], [165, 611], [165, 945], [165, 1117], [166, 308], [166, 311], [167, 308], [167, 311], [167, 609], [167, 611], [167, 945], [168, 308], [168, 311], [169, 308], [169, 311], [170, 308], [170, 309], [170, 310], [170, 311], [171, 67], [172, 115], [172, 819], [173, 129], [173, 314], [173, 441], [173, 1158], [173, 1200], [173, 1224], [174, 129], [175, 106], [175, 925], [175, 1117], [176, 416], [176, 501], [176, 580], [176, 1205], [176, 1206], [177, 114], [177, 115], [177, 819], [178, 415], [178, 496], [178, 503], [178, 580], [179, 415], [179, 496], [179, 503], [179, 580], [182, 415], [182, 423], [182, 491], [182, 492], [182, 580], [183, 415], [183, 423], [183, 491], [183, 492], [183, 580], [184, 129], [184, 415], [184, 423], [184, 483], [184, 503], [184, 504], [184, 512], [184, 580], [184, 706], [184, 859], [184, 860], [185, 415], [185, 423], [185, 503], [185, 504], [185, 580], [185, 859], [185, 860], [186, 129], [186, 415], [186, 423], [186, 483], [186, 503], [186, 504], [186, 512], [186, 580], [186, 706], [186, 859], [186, 860], [187, 415], [187, 423], [187, 501], [187, 580], [188, 415], [188, 423], [188, 501], [188, 580], [188, 712], [188, 714], [188, 881], [188, 882], [189, 415], [189, 423], [189, 501], [189, 580], [198, 21], [198, 736], [200, 442], [200, 926], [202, 757], [207, 923], [208, 923], [209, 923], [210, 141], [210, 145], [210, 148], [210, 161], [210, 162], [210, 172], [210, 174], [210, 542], [210, 547], [210, 550], [210, 978], [210, 1002], [211, 881], [211, 882], [213, 691], [213, 760], [213, 761], [214, 85], [214, 88], [214, 691], [214, 760], [214, 761], [215, 757], [215, 814], [215, 821], [215, 940], [216, 83], [216, 85], [216, 88], [216, 129], [217, 83], [217, 85], [217, 88], [217, 314], [217, 757], [217, 1158], [217, 1224], [218, 83], [218, 85], [218, 88], [219, 83], [219, 85], [219, 88], [222, 984], [222, 1012], [225, 76], [225, 123], [225, 131], [225, 257], [225, 258], [225, 280], [225, 282], [225, 325], [225, 337], [225, 379], [225, 380], [225, 411], [225, 412], [225, 421], [225, 428], [225, 506], [225, 696], [225, 772], [225, 821], [225, 1081], [225, 1083], [225, 1142], [225, 1143], [225, 1144], [225, 1149], [225, 1161], [225, 1162], [225, 1183], [225, 1194], [225, 1223], [225, 1226], [225, 1227], [226, 264], [226, 276], [226, 372], [226, 415], [226, 422], [226, 491], [226, 503], [226, 580], [227, 923], [228, 415], [228, 422], [228, 491], [228, 580], [228, 881], [228, 882], [229, 454], [229, 819], [229, 984], [229, 1012], [230, 106], [230, 454], [230, 819], [230, 924], [231, 66], [231, 247], [231, 350], [231, 351], [231, 353], [231, 376], [231, 693], [231, 788], [231, 789], [231, 811], [231, 812], [231, 1023], [231, 1048], [232, 13], [232, 16], [232, 89], [232, 129], [232, 245], [232, 290], [232, 293], [232, 349], [232, 369], [232, 478], [232, 503], [232, 512], [232, 592], [232, 617], [232, 621], [232, 627], [232, 644], [232, 944], [232, 1050], [232, 1057], [232, 1059], [232, 1187], [232, 1188], [233, 514], [233, 1262], [235, 217], [235, 633], [235, 637], [237, 264], [237, 308], [237, 309], [237, 311], [237, 312], [237, 313], [238, 264], [238, 308], [238, 309], [238, 311], [238, 312], [238, 313], [239, 28], [239, 442], [239, 757], [239, 859], [239, 926], [240, 413], [240, 655], [240, 763], [244, 170], [244, 213], [244, 735], [245, 308], [245, 311], [245, 548], [245, 550], [245, 920], [245, 977], [247, 106], [247, 579], [248, 1181], [249, 106], [249, 579], [250, 954], [250, 960], [250, 987], [252, 217], [252, 360], [252, 433], [252, 434], [252, 435], [252, 478], [252, 564], [252, 617], [252, 619], [252, 633], [252, 637], [252, 691], [252, 760], [252, 761], [252, 788], [252, 789], [255, 94], [255, 97], [255, 308], [255, 821], [256, 249], [256, 821], [256, 927], [257, 257], [257, 337], [257, 772], [258, 249], [258, 927], [259, 238], [259, 240], [259, 244], [259, 257], [259, 337], [259, 772], [259, 927], [259, 1117], [260, 238], [260, 240], [260, 244], [260, 927], [261, 238], [261, 240], [261, 244], [261, 257], [261, 322], [261, 327], [261, 337], [261, 609], [261, 611], [261, 772], [261, 927], [261, 936], [261, 945], [262, 238], [262, 240], [262, 244], [262, 257], [262, 337], [262, 772], [262, 927], [263, 238], [263, 240], [263, 244], [263, 927], [264, 814], [264, 821], [264, 940], [265, 308], [265, 614], [266, 0], [266, 1], [266, 10], [266, 25], [266, 40], [266, 51], [266, 71], [266, 103], [266, 139], [266, 219], [266, 245], [266, 248], [266, 257], [266, 266], [266, 271], [266, 274], [266, 304], [266, 339], [266, 409], [266, 413], [266, 425], [266, 449], [266, 451], [266, 452], [266, 453], [266, 470], [266, 479], [266, 550], [266, 556], [266, 559], [266, 560], [266, 565], [266, 591], [266, 603], [266, 652], [266, 654], [266, 691], [266, 701], [266, 748], [266, 768], [266, 769], [266, 775], [266, 797], [266, 799], [266, 802], [266, 859], [266, 860], [266, 870], [266, 884], [266, 894], [266, 898], [266, 905], [266, 916], [266, 937], [266, 944], [266, 945], [266, 947], [266, 949], [266, 972], [266, 1010], [266, 1011], [266, 1019], [266, 1033], [266, 1081], [266, 1095], [266, 1106], [266, 1123], [266, 1126], [266, 1197], [266, 1205], [266, 1206], [266, 1207], [267, 0], [267, 1], [267, 2], [267, 10], [267, 25], [267, 40], [267, 51], [267, 71], [267, 139], [267, 219], [267, 245], [267, 248], [267, 266], [267, 271], [267, 304], [267, 339], [267, 343], [267, 413], [267, 425], [267, 449], [267, 451], [267, 452], [267, 453], [267, 470], [267, 479], [267, 565], [267, 591], [267, 603], [267, 652], [267, 654], [267, 691], [267, 701], [267, 768], [267, 769], [267, 775], [267, 797], [267, 799], [267, 802], [267, 850], [267, 851], [267, 884], [267, 894], [267, 898], [267, 905], [267, 916], [267, 944], [267, 945], [267, 947], [267, 949], [267, 1011], [267, 1019], [267, 1033], [267, 1081], [267, 1095], [267, 1106], [267, 1110], [267, 1123], [267, 1126], [267, 1169], [267, 1209], [268, 0], [268, 1], [268, 10], [268, 25], [268, 40], [268, 51], [268, 139], [268, 219], [268, 245], [268, 266], [268, 304], [268, 339], [268, 413], [268, 449], [268, 451], [268, 452], [268, 453], [268, 470], [268, 479], [268, 565], [268, 591], [268, 603], [268, 652], [268, 654], [268, 691], [268, 701], [268, 768], [268, 769], [268, 775], [268, 797], [268, 799], [268, 802], [268, 884], [268, 894], [268, 898], [268, 905], [268, 916], [268, 944], [268, 945], [268, 947], [268, 949], [268, 1011], [268, 1019], [268, 1033], [268, 1081], [268, 1095], [268, 1106], [268, 1110], [268, 1123], [268, 1126], [268, 1208], [269, 226], [269, 757], [269, 997], [270, 107], [270, 217], [270, 226], [270, 264], [270, 324], [270, 1191], [271, 28], [271, 112], [271, 192], [271, 226], [271, 227], [271, 244], [271, 328], [271, 330], [271, 442], [271, 859], [271, 926], [271, 927], [271, 931], [271, 1098], [271, 1106], [271, 1117], [271, 1119], [272, 420], [273, 819], [273, 1191], [274, 308], [274, 311], [274, 609], [274, 611], [274, 821], [274, 945], [275, 308], [275, 311], [275, 1191], [276, 254], [276, 256], [276, 257], [277, 519], [277, 757], [278, 519], [279, 454], [279, 819], [280, 17], [280, 19], [280, 20], [280, 900], [281, 819], [282, 609], [282, 611], [282, 945], [283, 819], [284, 690], [284, 696], [284, 813], [284, 815], [284, 817], [284, 821], [285, 427], [285, 428], [285, 543], [285, 544], [285, 696], [286, 427], [286, 428], [286, 543], [286, 544], [286, 696], [287, 427], [287, 428], [287, 543], [287, 544], [287, 696], [288, 427], [288, 428], [288, 543], [288, 544], [288, 696], [289, 427], [289, 428], [289, 543], [289, 544], [289, 696], [290, 270], [290, 691], [290, 1090], [291, 845], [293, 741], [293, 828], [295, 217], [295, 360], [295, 433], [295, 434], [295, 435], [295, 564], [295, 633], [295, 637], [295, 788], [295, 789], [296, 321], [296, 322], [296, 547], [296, 550], [296, 748], [296, 757], [296, 936], [296, 975], [296, 976], [297, 83], [297, 85], [297, 88], [297, 124], [297, 903], [297, 928], [298, 141], [298, 145], [298, 148], [298, 161], [298, 162], [298, 172], [298, 542], [298, 547], [298, 550], [298, 978], [299, 124], [300, 781], [300, 783], [302, 894], [302, 947], [302, 954], [302, 958], [303, 894], [303, 947], [306, 1110], [306, 1208], [308, 238], [308, 240], [308, 244], [308, 465], [308, 927], [308, 936], [308, 984], [308, 1012], [309, 442], [309, 926], [310, 328], [310, 330], [311, 126], [312, 407], [312, 819], [316, 289], [317, 289], [318, 106], [318, 925], [319, 106], [319, 925], [320, 106], [320, 757], [320, 925], [321, 454], [321, 819], [322, 442], [322, 926], [323, 903], [323, 928], [324, 903], [324, 928], [326, 65], [326, 181], [326, 182], [326, 184], [326, 185], [326, 186], [326, 196], [326, 197], [326, 200], [326, 350], [326, 353], [326, 355], [326, 356], [326, 786], [326, 789], [326, 792], [326, 793], [326, 801], [326, 802], [326, 804], [326, 811], [326, 812], [326, 876], [326, 1068], [326, 1078], [326, 1177], [326, 1178], [327, 65], [327, 181], [327, 182], [327, 184], [327, 185], [327, 186], [327, 196], [327, 197], [327, 200], [327, 350], [327, 353], [327, 355], [327, 356], [327, 786], [327, 789], [327, 792], [327, 793], [327, 801], [327, 802], [327, 804], [327, 811], [327, 812], [327, 876], [327, 1068], [327, 1078], [327, 1177], [327, 1178], [328, 65], [328, 181], [328, 182], [328, 184], [328, 185], [328, 186], [328, 196], [328, 197], [328, 200], [328, 350], [328, 353], [328, 355], [328, 356], [328, 786], [328, 789], [328, 792], [328, 793], [328, 801], [328, 802], [328, 804], [328, 811], [328, 812], [328, 876], [328, 1068], [328, 1078], [328, 1177], [328, 1178], [330, 288], [330, 306], [330, 699], [330, 705], [331, 288], [331, 306], [333, 192], [333, 929], [333, 931], [333, 945], [333, 981], [336, 267], [336, 420], [336, 538], [336, 544], [336, 777], [336, 1008], [337, 267], [337, 420], [337, 538], [337, 544], [337, 777], [337, 1008], [338, 91], [338, 267], [338, 420], [338, 505], [338, 510], [338, 538], [338, 544], [338, 777], [338, 1008], [338, 1131], [338, 1139], [340, 593], [347, 264], [356, 954], [356, 1087], [356, 1088], [356, 1089], [357, 104], [357, 179], [357, 207], [357, 267], [357, 297], [357, 544], [357, 842], [357, 1008], [373, 833], [373, 1256], [373, 1258], [374, 939], [374, 954], [374, 955], [374, 956], [375, 364], [375, 1081], [375, 1111], [375, 1150], [375, 1190], [376, 364], [376, 1081], [376, 1111], [376, 1150], [376, 1190], [377, 364], [377, 1081], [377, 1111], [377, 1150], [377, 1190], [378, 364], [378, 1081], [378, 1111], [378, 1143], [378, 1144], [378, 1150], [378, 1190], [379, 364], [379, 1081], [379, 1111], [379, 1150], [379, 1190], [380, 364], [380, 1081], [380, 1111], [380, 1150], [380, 1190], [383, 600], [383, 1168], [384, 600], [384, 1168], [385, 415], [385, 422], [385, 478], [385, 491], [385, 503], [385, 540], [385, 550], [385, 580], [385, 748], [391, 28], [391, 859], [392, 478], [392, 540], [396, 256], [396, 257], [398, 121], [398, 122], [398, 135], [398, 136], [398, 268], [398, 320], [398, 527], [398, 528], [399, 121], [399, 122], [399, 135], [399, 136], [399, 268], [399, 320], [399, 527], [399, 528], [400, 18], [400, 19], [400, 20], [400, 121], [400, 122], [400, 135], [400, 136], [400, 150], [400, 192], [400, 222], [400, 248], [400, 320], [400, 365], [400, 420], [400, 448], [400, 477], [400, 480], [400, 489], [400, 495], [400, 530], [400, 584], [400, 757], [400, 881], [400, 882], [400, 886], [400, 932], [400, 933], [400, 1072], [400, 1194], [400, 1227], [401, 18], [401, 19], [401, 20], [401, 105], [401, 121], [401, 122], [401, 135], [401, 136], [401, 150], [401, 192], [401, 222], [401, 248], [401, 320], [401, 365], [401, 420], [401, 448], [401, 477], [401, 480], [401, 489], [401, 495], [401, 530], [401, 584], [401, 881], [401, 882], [401, 886], [401, 932], [401, 933], [401, 1072], [401, 1194], [401, 1227], [402, 268], [402, 528], [402, 691], [402, 760], [402, 761], [403, 461], [403, 462], [405, 268], [405, 527], [405, 528], [406, 268], [406, 527], [407, 17], [407, 18], [407, 19], [407, 20], [407, 318], [407, 536], [407, 754], [407, 755], [407, 1016], [408, 718], [408, 722], [408, 845], [409, 409], [409, 410], [409, 414], [409, 691], [409, 699], [409, 700], [409, 705], [409, 759], [409, 760], [409, 761], [409, 859], [409, 860], [412, 0], [412, 11], [412, 246], [412, 248], [412, 250], [412, 271], [412, 425], [412, 573], [412, 576], [412, 578], [412, 603], [412, 691], [412, 712], [412, 715], [412, 854], [413, 1148], [414, 757], [414, 832], [414, 833], [417, 415], [417, 422], [417, 503], [417, 580], [419, 192], [419, 257], [419, 337], [419, 772], [419, 929], [419, 930], [419, 931], [419, 1148], [420, 192], [420, 264], [420, 442], [420, 926], [420, 929], [420, 931], [421, 172], [421, 192], [421, 257], [421, 288], [421, 330], [421, 337], [421, 381], [421, 442], [421, 498], [421, 526], [421, 710], [421, 772], [421, 881], [421, 882], [421, 926], [421, 930], [421, 931], [421, 932], [421, 933], [421, 1099], [424, 192], [424, 257], [424, 337], [424, 772], [424, 930], [424, 931], [425, 513], [425, 514], [425, 945], [425, 981], [425, 982], [426, 0], [426, 601], [426, 603], [428, 525], [428, 541], [429, 541], [431, 525], [431, 541], [433, 247], [433, 374], [433, 399], [433, 447], [433, 490], [433, 646], [433, 647], [433, 712], [433, 714], [433, 898], [433, 909], [433, 910], [434, 870], [434, 939], [434, 954], [434, 957], [434, 958], [435, 939], [435, 954], [435, 957], [435, 958], [435, 968], [436, 939], [436, 954], [436, 957], [436, 958], [436, 968], [437, 150], [437, 222], [437, 261], [437, 983], [438, 267], [438, 544], [438, 777], [438, 779], [438, 783], [438, 880], [438, 1008], [439, 51], [439, 133], [439, 198], [439, 203], [439, 211], [439, 266], [439, 267], [439, 297], [439, 339], [439, 340], [439, 544], [439, 691], [439, 699], [439, 705], [439, 726], [439, 881], [439, 882], [439, 905], [439, 944], [439, 945], [439, 949], [439, 1008], [439, 1033], [439, 1106], [439, 1114], [439, 1123], [439, 1129], [440, 87], [440, 88], [440, 121], [440, 122], [440, 135], [440, 136], [440, 142], [440, 143], [440, 267], [440, 268], [440, 320], [440, 527], [440, 528], [440, 544], [440, 548], [440, 550], [440, 777], [440, 779], [440, 781], [440, 783], [440, 880], [440, 920], [440, 977], [440, 1008], [441, 267], [441, 544], [441, 777], [441, 779], [441, 783], [441, 880], [441, 1008], [442, 267], [442, 544], [442, 777], [442, 779], [442, 783], [442, 880], [442, 954], [442, 957], [442, 1008], [444, 782], [444, 783], [445, 696], [445, 757], [445, 819], [447, 939], [447, 954], [447, 955], [447, 956], [447, 957], [447, 958], [447, 959], [447, 960], [447, 961], [447, 963], [447, 964], [447, 968], [447, 987], [447, 1088], [448, 0], [448, 175], [448, 603], [448, 939], [448, 954], [448, 957], [448, 958], [449, 954], [449, 958], [449, 960], [449, 969], [449, 987], [450, 954], [450, 958], [450, 968], [451, 939], [451, 954], [451, 956], [452, 939], [452, 954], [453, 939], [453, 954], [453, 957], [453, 958], [454, 939], [454, 954], [454, 955], [454, 956], [454, 957], [454, 958], [454, 959], [454, 960], [454, 961], [454, 963], [454, 964], [454, 968], [454, 987], [454, 1087], [455, 939], [455, 954], [455, 957], [455, 958], [456, 939], [456, 954], [456, 957], [456, 958], [457, 954], [457, 958], [458, 939], [458, 954], [458, 955], [458, 956], [458, 957], [458, 958], [458, 959], [458, 960], [458, 961], [458, 964], [458, 968], [459, 939], [459, 954], [459, 957], [459, 958], [460, 939], [460, 954], [460, 957], [460, 958], [460, 966], [461, 939], [461, 954], [461, 957], [461, 958], [461, 966], [462, 424], [462, 939], [462, 954], [462, 955], [462, 956], [462, 957], [462, 958], [462, 959], [462, 960], [462, 963], [462, 968], [462, 987], [463, 242], [463, 243], [463, 299], [463, 492], [463, 843], [463, 939], [463, 954], [463, 955], [463, 956], [463, 957], [463, 958], [464, 242], [464, 243], [464, 299], [464, 492], [464, 843], [464, 939], [464, 954], [464, 955], [464, 956], [465, 242], [465, 243], [465, 299], [465, 419], [465, 485], [465, 492], [465, 493], [465, 843], [465, 939], [465, 954], [465, 955], [465, 956], [465, 957], [465, 958], [466, 242], [466, 243], [466, 299], [466, 492], [466, 843], [466, 954], [466, 957], [466, 963], [467, 242], [467, 243], [467, 299], [467, 492], [467, 843], [467, 939], [467, 954], [467, 955], [467, 956], [468, 242], [468, 243], [468, 299], [468, 492], [468, 843], [468, 939], [468, 954], [468, 957], [468, 958], [469, 242], [469, 243], [469, 299], [469, 492], [469, 843], [469, 939], [469, 954], [469, 955], [470, 242], [470, 243], [470, 299], [470, 492], [470, 843], [470, 939], [470, 954], [470, 955], [471, 242], [471, 243], [471, 299], [471, 492], [471, 843], [472, 242], [472, 243], [472, 299], [472, 492], [472, 843], [473, 91], [473, 242], [473, 243], [473, 299], [473, 492], [473, 505], [473, 510], [473, 843], [473, 939], [473, 954], [473, 957], [473, 958], [473, 1263], [473, 1264], [474, 242], [474, 243], [474, 299], [474, 492], [474, 843], [474, 939], [474, 954], [474, 955], [474, 956], [474, 957], [474, 958], [474, 963], [475, 91], [475, 314], [475, 388], [475, 393], [475, 505], [475, 510], [475, 577], [475, 899], [475, 907], [475, 1110], [475, 1131], [475, 1134], [475, 1169], [475, 1198], [475, 1203], [475, 1209], [475, 1240], [475, 1241], [475, 1243], [475, 1245], [475, 1247], [476, 314], [476, 388], [476, 393], [476, 577], [476, 899], [476, 907], [476, 1110], [476, 1169], [476, 1198], [476, 1203], [476, 1209], [476, 1240], [476, 1241], [476, 1243], [476, 1247], [477, 388], [477, 393], [477, 577], [477, 899], [477, 907], [477, 1240], [477, 1241], [477, 1244], [479, 314], [479, 384], [479, 393], [479, 518], [479, 577], [479, 1072], [481, 386], [481, 393], [481, 577], [482, 1177], [482, 1178], [484, 126], [484, 217], [484, 633], [484, 639], [484, 954], [484, 961], [484, 964], [484, 1018], [484, 1022], [484, 1046], [484, 1058], [486, 460], [486, 513], [486, 514], [486, 699], [486, 705], [486, 1047], [487, 217], [487, 633], [487, 639], [489, 945], [489, 981], [489, 982], [491, 217], [491, 633], [491, 639], [491, 640], [492, 17], [492, 19], [492, 20], [492, 302], [498, 67], [498, 757], [498, 816], [498, 1212], [501, 42], [501, 264], [501, 308], [501, 309], [501, 311], [501, 312], [501, 313], [501, 1034], [501, 1140], [503, 247], [503, 290], [503, 292], [503, 365], [503, 474], [503, 692], [503, 1050], [504, 247], [504, 290], [504, 292], [504, 365], [504, 474], [504, 692], [504, 882], [504, 1050], [505, 247], [505, 290], [505, 292], [505, 365], [505, 474], [505, 692], [505, 882], [505, 1050], [506, 247], [506, 290], [506, 292], [506, 365], [506, 474], [506, 692], [506, 757], [506, 882], [506, 1050], [509, 103], [509, 259], [509, 268], [509, 316], [509, 501], [509, 527], [509, 528], [509, 567], [509, 607], [509, 653], [509, 656], [509, 691], [509, 699], [509, 700], [509, 705], [509, 712], [509, 714], [509, 759], [509, 760], [509, 761], [509, 859], [509, 881], [509, 882], [509, 946], [509, 1192], [511, 123], [511, 132], [511, 147], [511, 199], [511, 283], [511, 519], [511, 690], [511, 696], [511, 757], [511, 821], [511, 1196], [512, 132], [512, 147], [512, 519], [512, 1196], [513, 73], [513, 762], [515, 236], [515, 927], [516, 147], [516, 519], [516, 757], [516, 1110], [516, 1196], [516, 1209], [516, 1210], [517, 147], [517, 519], [517, 1196], [518, 217], [518, 633], [518, 638], [518, 639], [521, 921], [521, 1177], [521, 1178], [522, 921], [522, 1177], [522, 1178], [523, 921], [523, 1177], [523, 1178], [524, 921], [524, 1177], [524, 1178], [525, 921], [525, 1177], [525, 1178], [526, 921], [526, 1177], [526, 1178], [527, 921], [527, 1177], [527, 1178], [528, 921], [528, 1177], [528, 1178], [529, 921], [529, 1177], [529, 1178], [530, 921], [530, 1177], [530, 1178], [531, 845], [532, 833], [532, 845], [532, 1256], [532, 1259], [534, 385], [534, 393], [534, 577], [535, 248], [535, 271], [535, 272], [535, 314], [535, 385], [535, 393], [535, 425], [535, 449], [535, 456], [535, 577], [535, 632], [535, 899], [535, 904], [535, 1070], [535, 1151], [535, 1158], [535, 1220], [535, 1221], [535, 1224], [535, 1255], [535, 1267], [536, 696], [536, 819], [537, 437], [537, 439], [537, 440], [537, 819], [537, 1031], [537, 1049], [537, 1105], [539, 132], [539, 364], [539, 478], [539, 617], [539, 621], [539, 1030], [539, 1190], [541, 76], [541, 380], [543, 819], [544, 696], [544, 819], [549, 712], [549, 713], [550, 712], [550, 713], [551, 307], [551, 623], [552, 1009], [552, 1012], [553, 885], [556, 757], [559, 51], [559, 107], [559, 141], [559, 145], [559, 148], [559, 150], [559, 161], [559, 162], [559, 172], [559, 217], [559, 222], [559, 261], [559, 324], [559, 387], [559, 393], [559, 413], [559, 549], [559, 550], [559, 552], [559, 553], [559, 577], [559, 756], [559, 775], [559, 905], [559, 913], [559, 944], [559, 945], [559, 974], [559, 983], [559, 1031], [559, 1099], [559, 1105], [559, 1216], [559, 1236], [560, 437], [560, 439], [560, 440], [560, 449], [560, 456], [560, 1031], [560, 1049], [560, 1105], [560, 1220], [560, 1221], [561, 437], [561, 439], [561, 440], [561, 994], [561, 1217], [562, 440], [563, 126], [564, 126], [564, 174], [564, 587], [564, 588], [564, 1003], [564, 1058], [565, 126], [566, 126], [568, 126], [569, 126], [570, 126], [571, 126], [571, 174], [571, 587], [571, 588], [571, 1003], [571, 1058], [572, 126], [572, 691], [572, 757], [572, 760], [572, 761], [572, 1177], [572, 1178], [572, 1194], [572, 1227], [573, 126], [573, 587], [573, 588], [573, 1058], [574, 126], [576, 106], [576, 691], [576, 1090], [577, 1194], [577, 1228], [579, 74], [579, 90], [579, 126], [579, 356], [579, 359], [579, 398], [579, 401], [579, 404], [579, 413], [579, 654], [579, 655], [579, 708], [579, 709], [579, 718], [579, 719], [579, 720], [579, 721], [579, 722], [579, 723], [579, 724], [579, 725], [579, 756], [579, 763], [579, 767], [579, 768], [579, 770], [579, 805], [579, 806], [579, 807], [579, 808], [579, 810], [579, 812], [579, 845], [579, 990], [579, 1058], [579, 1069], [579, 1102], [579, 1103], [582, 1004], [582, 1190], [583, 1004], [583, 1190], [584, 757], [584, 1004], [584, 1190], [585, 1004], [585, 1190], [587, 1004], [587, 1190], [588, 1004], [588, 1190], [589, 478], [589, 617], [589, 621], [589, 1004], [589, 1072], [589, 1190], [590, 478], [590, 617], [590, 621], [590, 1004], [590, 1072], [590, 1190], [591, 478], [591, 617], [591, 621], [591, 1004], [591, 1072], [591, 1190], [592, 478], [592, 498], [592, 499], [592, 617], [592, 621], [592, 1004], [592, 1051], [592, 1055], [592, 1056], [592, 1190], [593, 478], [593, 498], [593, 499], [593, 617], [593, 621], [593, 1004], [593, 1190], [594, 1004], [594, 1190], [599, 38], [599, 851], [599, 865], [599, 997], [599, 998], [599, 1190], [600, 38], [600, 851], [600, 865], [600, 997], [600, 998], [600, 1043], [600, 1105], [600, 1110], [600, 1190], [600, 1209], [600, 1210], [601, 38], [601, 851], [601, 865], [601, 997], [601, 998], [601, 1043], [601, 1105], [601, 1190], [602, 38], [602, 851], [602, 865], [602, 997], [602, 998], [602, 1043], [602, 1105], [602, 1110], [602, 1190], [602, 1209], [602, 1210], [603, 38], [603, 851], [603, 865], [603, 997], [603, 998], [603, 1043], [603, 1105], [603, 1190], [604, 38], [604, 851], [604, 865], [604, 997], [604, 998], [604, 1043], [604, 1105], [604, 1110], [604, 1190], [604, 1209], [604, 1210], [605, 38], [605, 851], [605, 865], [605, 997], [605, 998], [605, 1043], [605, 1105], [605, 1110], [605, 1190], [605, 1209], [605, 1210], [606, 38], [606, 851], [606, 865], [606, 997], [606, 998], [606, 1043], [606, 1105], [606, 1190], [607, 38], [607, 851], [607, 865], [607, 997], [607, 998], [607, 1043], [607, 1105], [607, 1190], [608, 38], [608, 851], [608, 865], [608, 997], [608, 998], [608, 1043], [608, 1105], [608, 1110], [608, 1190], [608, 1209], [608, 1210], [609, 38], [609, 851], [609, 865], [609, 997], [609, 998], [609, 1043], [609, 1105], [609, 1190], [610, 38], [610, 121], [610, 122], [610, 135], [610, 136], [610, 851], [610, 865], [610, 997], [610, 998], [610, 1035], [610, 1037], [610, 1038], [610, 1043], [610, 1105], [610, 1110], [610, 1168], [610, 1190], [610, 1209], [610, 1210], [611, 757], [611, 1004], [611, 1190], [612, 1004], [612, 1190], [614, 36], [614, 74], [614, 90], [614, 195], [614, 398], [614, 401], [614, 413], [614, 654], [614, 708], [614, 709], [614, 718], [614, 720], [614, 724], [614, 725], [614, 742], [614, 756], [614, 767], [614, 805], [614, 806], [614, 812], [614, 845], [614, 1069], [614, 1102], [615, 195], [615, 413], [615, 654], [615, 708], [615, 709], [615, 718], [615, 720], [615, 724], [615, 725], [615, 742], [615, 767], [615, 805], [615, 806], [615, 812], [615, 845], [615, 1069], [615, 1102], [618, 387], [618, 393], [618, 577], [618, 712], [618, 714], [621, 696], [621, 818], [621, 819], [622, 184], [622, 185], [622, 360], [622, 374], [622, 413], [622, 564], [622, 570], [622, 654], [622, 752], [622, 765], [622, 767], [622, 877], [623, 612], [623, 613], [623, 833], [623, 1249], [624, 66], [624, 184], [624, 185], [624, 247], [624, 350], [624, 351], [624, 353], [624, 374], [624, 413], [624, 570], [624, 654], [624, 693], [624, 767], [624, 788], [624, 789], [624, 811], [624, 812], [624, 941], [624, 979], [624, 1048], [625, 899], [625, 907], [627, 415], [627, 422], [627, 491], [627, 580], [627, 635], [627, 636], [628, 246], [628, 248], [628, 250], [628, 271], [628, 571], [628, 573], [628, 576], [628, 578], [628, 691], [628, 712], [628, 714], [628, 899], [628, 905], [628, 945], [628, 974], [629, 246], [629, 248], [629, 271], [629, 272], [629, 448], [629, 488], [629, 571], [629, 577], [629, 712], [629, 714], [629, 1240], [629, 1250], [629, 1254], [630, 245], [630, 1194], [630, 1227], [631, 593], [632, 147], [632, 519], [632, 1195], [633, 586], [633, 901], [634, 821], [634, 985], [634, 988], [635, 821], [635, 985], [635, 988], [636, 147], [636, 519], [636, 821], [636, 985], [636, 988], [636, 1195], [637, 123], [637, 258], [637, 411], [637, 428], [637, 696], [637, 821], [638, 123], [638, 258], [638, 411], [638, 428], [638, 696], [638, 821], [640, 123], [640, 130], [640, 277], [640, 586], [640, 821], [640, 995], [641, 147], [641, 519], [641, 586], [641, 995], [641, 1195], [642, 586], [642, 995], [643, 123], [643, 130], [643, 277], [643, 586], [643, 821], [643, 995], [645, 35], [645, 74], [645, 103], [645, 123], [645, 130], [645, 234], [645, 235], [645, 277], [645, 411], [645, 427], [645, 428], [645, 544], [645, 696], [645, 757], [645, 821], [645, 1008], [645, 1124], [645, 1125], [646, 123], [646, 130], [646, 277], [646, 544], [646, 821], [646, 1008], [646, 1124], [646, 1125], [647, 123], [647, 130], [647, 277], [647, 544], [647, 821], [647, 1008], [647, 1124], [647, 1125], [648, 123], [648, 130], [648, 277], [648, 544], [648, 821], [648, 1008], [648, 1124], [648, 1125], [650, 112], [650, 238], [650, 240], [650, 244], [650, 927], [650, 984], [650, 1012], [651, 1148], [653, 0], [653, 1], [653, 10], [653, 25], [653, 51], [653, 242], [653, 243], [653, 299], [653, 339], [653, 603], [653, 691], [653, 701], [653, 843], [653, 944], [654, 398], [654, 401], [658, 954], [658, 958], [658, 959], [658, 968], [658, 987], [659, 177], [659, 331], [659, 332], [659, 946], [661, 712], [661, 713], [661, 718], [661, 722], [661, 845], [662, 413], [662, 654], [662, 708], [662, 709], [662, 712], [662, 713], [662, 716], [662, 718], [662, 719], [662, 720], [662, 721], [662, 722], [662, 723], [662, 724], [662, 725], [662, 767], [662, 805], [662, 806], [662, 812], [662, 845], [662, 1069], [662, 1102], [662, 1103], [666, 954], [666, 987], [668, 314], [668, 594], [668, 595], [668, 718], [668, 722], [668, 845], [670, 819], [671, 217], [671, 633], [671, 639], [671, 640], [672, 217], [672, 633], [672, 639], [672, 640], [673, 217], [673, 633], [673, 639], [673, 640], [674, 217], [674, 633], [674, 639], [674, 640], [675, 217], [675, 633], [675, 639], [675, 640], [677, 75], [677, 76], [677, 123], [677, 199], [677, 258], [677, 279], [677, 283], [677, 380], [677, 411], [677, 412], [677, 428], [677, 696], [677, 821], [679, 823], [679, 827], [679, 1194], [679, 1226], [681, 19], [681, 20], [681, 84], [681, 85], [681, 88], [681, 372], [681, 511], [681, 1117], [681, 1119], [682, 696], [682, 818], [682, 819], [683, 29], [683, 30], [683, 281], [683, 284], [683, 349], [683, 370], [683, 627], [683, 644], [683, 873], [683, 888], [683, 1188], [684, 577], [684, 691], [684, 1090], [684, 1240], [684, 1241], [684, 1245], [684, 1247], [685, 0], [685, 1], [685, 10], [685, 25], [685, 170], [685, 550], [685, 603], [685, 735], [685, 748], [685, 905], [685, 945], [685, 949], [685, 974], [685, 1033], [685, 1106], [685, 1110], [685, 1123], [685, 1129], [685, 1170], [685, 1209], [686, 0], [686, 1], [686, 25], [686, 242], [686, 243], [686, 299], [686, 603], [686, 691], [686, 760], [686, 761], [686, 843], [686, 883], [686, 897], [686, 1011], [686, 1019], [686, 1020], [686, 1045], [686, 1113], [688, 413], [688, 550], [688, 655], [688, 748], [688, 1019], [688, 1020], [689, 314], [689, 577], [689, 1110], [689, 1169], [689, 1198], [689, 1203], [689, 1209], [689, 1240], [689, 1241], [689, 1243], [689, 1244], [689, 1245], [689, 1246], [689, 1247], [690, 248], [690, 271], [690, 272], [690, 425], [691, 248], [691, 271], [691, 272], [691, 425], [693, 257], [693, 337], [693, 772], [694, 53], [694, 67], [694, 734], [694, 1012], [694, 1214], [695, 1191], [696, 848], [696, 861], [696, 862], [696, 863], [702, 364], [702, 1190], [703, 364], [703, 1190], [705, 132], [705, 898], [705, 909], [705, 910], [706, 91], [706, 505], [706, 510], [706, 1130], [706, 1131], [707, 61], [707, 1216], [707, 1237], [708, 115], [708, 819], [709, 115], [709, 819], [711, 780], [711, 783], [711, 880], [712, 882], [714, 0], [714, 11], [714, 91], [714, 141], [714, 148], [714, 169], [714, 170], [714, 172], [714, 173], [714, 505], [714, 510], [714, 589], [714, 590], [714, 602], [714, 603], [714, 604], [714, 605], [714, 694], [714, 703], [714, 712], [714, 714], [714, 843], [714, 854], [714, 858], [714, 1006], [714, 1264], [715, 141], [715, 148], [715, 169], [715, 170], [715, 172], [715, 173], [715, 589], [715, 590], [715, 602], [715, 603], [715, 604], [715, 605], [715, 694], [715, 703], [715, 712], [715, 714], [715, 843], [715, 858], [715, 1006], [716, 691], [716, 1090], [717, 899], [717, 1187], [717, 1188], [718, 74], [718, 90], [718, 104], [718, 188], [718, 189], [718, 207], [718, 374], [718, 382], [718, 413], [718, 654], [718, 708], [718, 709], [718, 718], [718, 719], [718, 720], [718, 721], [718, 724], [718, 725], [718, 767], [718, 805], [718, 806], [718, 812], [718, 842], [718, 845], [718, 990], [718, 1069], [718, 1102], [718, 1103], [719, 550], [719, 585], [719, 992], [719, 1072], [719, 1187], [719, 1188], [721, 226], [721, 227], [721, 1098], [721, 1106], [722, 787], [722, 789], [723, 75], [723, 76], [723, 77], [723, 138], [723, 192], [723, 275], [723, 338], [723, 341], [723, 930], [724, 76], [724, 98], [724, 269], [724, 319], [724, 946], [731, 269], [731, 946], [732, 269], [732, 946], [733, 269], [733, 946], [734, 750], [734, 751], [734, 829], [736, 779], [736, 783], [736, 880], [738, 413], [738, 655], [738, 763], [740, 596], [740, 607], [740, 653], [740, 656], [744, 94], [744, 95], [744, 308], [745, 54], [745, 150], [745, 222], [745, 224], [745, 228], [745, 677], [745, 678], [745, 679], [745, 680], [745, 681], [745, 682], [745, 683], [745, 684], [745, 691], [745, 698], [745, 699], [745, 700], [745, 702], [745, 705], [745, 759], [745, 760], [745, 761], [746, 36], [746, 74], [746, 90], [746, 374], [746, 382], [746, 413], [746, 654], [746, 708], [746, 709], [746, 712], [746, 716], [746, 718], [746, 719], [746, 720], [746, 721], [746, 722], [746, 723], [746, 724], [746, 725], [746, 756], [746, 767], [746, 805], [746, 806], [746, 812], [746, 845], [746, 921], [746, 922], [746, 990], [746, 1069], [746, 1102], [746, 1103], [746, 1106], [746, 1110], [746, 1123], [746, 1209], [747, 74], [747, 90], [747, 709], [747, 718], [747, 719], [747, 720], [747, 721], [747, 724], [747, 845], [747, 990], [747, 1069], [747, 1102], [747, 1103], [748, 897], [750, 449], [750, 456], [750, 1072], [750, 1220], [750, 1221], [751, 387], [751, 393], [751, 577], [752, 577], [752, 1240], [752, 1241], [752, 1246], [755, 848], [755, 861], [755, 863], [756, 384], [756, 393], [756, 577], [756, 1072], [757, 387], [757, 393], [757, 413], [757, 577], [757, 654], [757, 769], [758, 28], [758, 387], [758, 393], [758, 413], [758, 577], [758, 654], [758, 769], [758, 859], [762, 1051], [762, 1055], [763, 364], [763, 1190], [770, 256], [770, 257], [770, 395], [770, 696], [771, 1156], [771, 1160], [772, 449], [782, 29], [782, 30], [782, 33], [782, 121], [782, 122], [782, 141], [782, 145], [782, 148], [782, 161], [782, 162], [782, 172], [782, 183], [782, 184], [782, 204], [782, 246], [782, 248], [782, 271], [782, 281], [782, 284], [782, 349], [782, 360], [782, 370], [782, 425], [782, 449], [782, 456], [782, 547], [782, 549], [782, 550], [782, 553], [782, 564], [782, 607], [782, 626], [782, 627], [782, 629], [782, 630], [782, 631], [782, 644], [782, 694], [782, 707], [782, 809], [782, 810], [782, 812], [782, 921], [782, 978], [782, 1106], [782, 1123], [782, 1129], [782, 1133], [782, 1177], [782, 1178], [782, 1188], [782, 1216], [782, 1218], [782, 1220], [782, 1239], [783, 66], [783, 247], [783, 350], [783, 351], [783, 353], [783, 693], [783, 788], [783, 789], [783, 811], [783, 812], [783, 1048], [784, 65], [784, 66], [784, 184], [784, 186], [784, 200], [784, 247], [784, 350], [784, 351], [784, 353], [784, 693], [784, 788], [784, 789], [784, 811], [784, 812], [784, 1048], [785, 823], [785, 827], [787, 751], [787, 829], [830, 428], [830, 464], [830, 582], [830, 586], [830, 696], [830, 995], [831, 151], [831, 153], [831, 180], [831, 1154], [831, 1194], [831, 1226], [831, 1229], [832, 151], [832, 153], [832, 180], [832, 1154], [833, 151], [833, 153], [833, 180], [833, 1154], [880, 151], [880, 153], [880, 1154], [882, 217], [882, 633], [882, 637], [890, 745], [890, 828], [919, 151], [919, 153], [919, 1154], [919, 1194], [919, 1226], [919, 1229], [920, 151], [920, 1154], [920, 1194], [920, 1226], [920, 1229], [921, 151], [921, 1154], [921, 1194], [921, 1226], [921, 1229], [932, 151], [932, 415], [932, 422], [932, 503], [932, 580], [932, 1154], [944, 151], [944, 1154], [959, 151], [959, 1154], [976, 151], [976, 1154], [977, 151], [977, 1154], [978, 151], [978, 1154], [989, 151], [989, 1154], [1009, 823], [1009, 827], [1013, 548], [1013, 550], [1013, 920], [1013, 977], [1020, 42], [1021, 139], [1021, 436], [1021, 757], [1022, 1051], [1022, 1055], [1025, 19], [1025, 20], [1026, 129], [1026, 421], [1026, 483], [1026, 506], [1026, 512], [1026, 1051], [1026, 1055], [1027, 19], [1027, 20], [1027, 129], [1027, 512], [1028, 421], [1028, 506], [1029, 19], [1029, 20], [1029, 1205], [1029, 1207], [1030, 19], [1030, 20], [1030, 129], [1030, 478], [1030, 483], [1030, 512], [1030, 617], [1030, 618], [1030, 619], [1030, 1051], [1030, 1055], [1031, 19], [1031, 20], [1032, 19], [1032, 20], [1032, 129], [1032, 421], [1032, 478], [1032, 483], [1032, 506], [1032, 512], [1032, 617], [1032, 618], [1032, 619], [1032, 1051], [1032, 1055], [1032, 1205], [1032, 1207], [1033, 19], [1033, 20], [1033, 421], [1033, 506], [1035, 106], [1036, 91], [1036, 505], [1036, 510], [1037, 91], [1037, 505], [1037, 510], [1038, 91], [1038, 505], [1038, 510], [1042, 1148], [1043, 416], [1043, 501], [1043, 580], [1043, 1148], [1044, 416], [1044, 501], [1044, 580], [1045, 416], [1045, 501], [1045, 580], [1046, 416], [1046, 501], [1046, 580], [1046, 1205], [1046, 1206], [1047, 478], [1047, 540], [1048, 1107], [1048, 1108], [1051, 757], [1053, 28], [1053, 442], [1053, 859], [1053, 926], [1054, 18], [1054, 19], [1054, 20], [1054, 531], [1054, 536], [1054, 1025], [1057, 13], [1057, 15], [1057, 16], [1057, 18], [1057, 19], [1057, 20], [1057, 89], [1057, 248], [1057, 401], [1057, 403], [1057, 448], [1057, 478], [1057, 480], [1057, 488], [1057, 503], [1057, 531], [1057, 532], [1057, 535], [1057, 536], [1057, 537], [1057, 617], [1057, 618], [1057, 621], [1057, 691], [1057, 698], [1057, 699], [1057, 705], [1057, 759], [1057, 760], [1057, 761], [1057, 868], [1057, 941], [1057, 944], [1057, 979], [1057, 994], [1057, 1004], [1057, 1016], [1057, 1025], [1057, 1029], [1057, 1190], [1057, 1194], [1057, 1226], [1058, 13], [1058, 15], [1058, 16], [1058, 18], [1058, 19], [1058, 20], [1058, 89], [1058, 401], [1058, 403], [1058, 478], [1058, 480], [1058, 503], [1058, 531], [1058, 532], [1058, 535], [1058, 536], [1058, 537], [1058, 617], [1058, 618], [1058, 621], [1058, 691], [1058, 698], [1058, 699], [1058, 705], [1058, 759], [1058, 760], [1058, 761], [1058, 868], [1058, 941], [1058, 944], [1058, 979], [1058, 994], [1058, 1004], [1058, 1016], [1058, 1025], [1058, 1029], [1058, 1190], [1058, 1194], [1058, 1226], [1059, 13], [1059, 15], [1059, 16], [1059, 18], [1059, 19], [1059, 20], [1059, 89], [1059, 401], [1059, 403], [1059, 478], [1059, 480], [1059, 503], [1059, 531], [1059, 532], [1059, 535], [1059, 536], [1059, 537], [1059, 617], [1059, 618], [1059, 621], [1059, 691], [1059, 698], [1059, 699], [1059, 705], [1059, 759], [1059, 760], [1059, 761], [1059, 868], [1059, 941], [1059, 944], [1059, 979], [1059, 994], [1059, 1004], [1059, 1016], [1059, 1025], [1059, 1029], [1059, 1190], [1059, 1194], [1059, 1226], [1061, 13], [1061, 15], [1061, 16], [1061, 18], [1061, 19], [1061, 20], [1061, 89], [1061, 107], [1061, 217], [1061, 324], [1061, 503], [1061, 531], [1061, 536], [1061, 941], [1061, 944], [1061, 979], [1061, 1025], [1061, 1070], [1063, 1012], [1063, 1013], [1067, 91], [1067, 163], [1067, 320], [1067, 505], [1067, 510], [1067, 544], [1067, 548], [1067, 550], [1067, 598], [1067, 951], [1067, 1071], [1067, 1076], [1067, 1081], [1067, 1082], [1067, 1085], [1067, 1131], [1067, 1139], [1067, 1150], [1067, 1178], [1067, 1179], [1067, 1194], [1067, 1225], [1067, 1228], [1068, 28], [1068, 424], [1068, 757], [1068, 859], [1069, 424], [1071, 75], [1071, 76], [1071, 757], [1071, 771], [1071, 778], [1071, 883], [1071, 1045], [1071, 1113], [1072, 75], [1072, 76], [1073, 75], [1073, 76], [1074, 75], [1074, 76], [1075, 75], [1075, 76], [1075, 883], [1075, 1045], [1075, 1113], [1075, 1205], [1075, 1206], [1075, 1211], [1076, 75], [1076, 76], [1077, 75], [1077, 76], [1078, 75], [1078, 76], [1081, 267], [1081, 320], [1081, 399], [1081, 544], [1081, 548], [1081, 550], [1081, 777], [1081, 780], [1081, 783], [1081, 880], [1081, 920], [1081, 977], [1081, 1008], [1081, 1051], [1081, 1055], [1081, 1181], [1082, 267], [1082, 320], [1082, 399], [1082, 544], [1082, 777], [1082, 780], [1082, 783], [1082, 880], [1082, 1008], [1082, 1051], [1082, 1055], [1082, 1181], [1083, 267], [1083, 320], [1083, 399], [1083, 544], [1083, 777], [1083, 780], [1083, 783], [1083, 880], [1083, 954], [1083, 960], [1083, 987], [1083, 1008], [1083, 1051], [1083, 1055], [1083, 1181], [1084, 29], [1084, 30], [1084, 281], [1084, 284], [1084, 349], [1084, 370], [1084, 627], [1084, 644], [1084, 1188], [1089, 169], [1089, 170], [1089, 627], [1089, 644], [1090, 819], [1093, 32], [1093, 169], [1093, 170], [1093, 413], [1093, 547], [1093, 550], [1093, 590], 